{
    "shloks": [
        {
            "id": "1-1",
            "chapter": 1,
            "verse": 1,
            "sanskrit": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
            "transliteration": "dhṛitarāśhtra uvācha dharma-kṣhetre kuru-kṣhetre samavetā yuyutsavaḥ māmakāḥ pāṇḍavāśhchaiva kim akurvata sañjaya",
            "simpleMeaning": "Dhritarashtra said: O Sanjaya, assembled on the sacred field of Kurukshetra, eager to fight, what did my sons and the sons of Pandu do?",
            "practicalExplanation": "This opening verse sets the stage for the entire Gita. Dhritarashtra's anxiety reveals the fundamental human struggle — the conflict between right and wrong, duty and desire. The 'field of dharma' represents our own conscience where we fight daily battles.",
            "strengthReflection": "I recognize that my life is a sacred battlefield where I must choose between what is easy and what is right.",
            "devotionalSurrender": "O Lord Krishna, as this great dialogue begins, open my heart to receive Your eternal wisdom.",
            "emotions": [
                "fear",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-2",
            "chapter": 1,
            "verse": 2,
            "sanskrit": "सञ्जय उवाच। दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा। आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
            "transliteration": "sañjaya uvācha dṛiṣhṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā āchāryam upasaṅgamya rājā vachanam abravīt",
            "simpleMeaning": "Sanjaya said: O King, after seeing the Pandava army arrayed in military formation, King Duryodhana approached his teacher Drona and spoke these words.",
            "practicalExplanation": "Even the arrogant Duryodhana felt the need for guidance when facing a challenging situation. This shows that no matter how confident we are, wisdom lies in seeking counsel from experienced mentors.",
            "strengthReflection": "I will seek guidance from wise mentors when facing important challenges in life.",
            "devotionalSurrender": "Lord, help me recognize the value of seeking wisdom from those who have walked the path before me.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-3",
            "chapter": 1,
            "verse": 3,
            "sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम्। व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता॥",
            "transliteration": "paśhyaitāṁ pāṇḍu-putrāṇām āchārya mahatīṁ chamūm vyūḍhāṁ drupada-putreṇa tava śhiṣhyeṇa dhīmatā",
            "simpleMeaning": "Behold, O teacher, this mighty army of the sons of Pandu, arrayed by your intelligent disciple, the son of Drupada.",
            "practicalExplanation": "Duryodhana tries to provoke Drona by reminding him that the opposing army is led by Dhristadyumna, Drona's own student. Life often presents us with situations where our own teachings or actions return to challenge us.",
            "strengthReflection": "I accept that my actions and teachings will have consequences that may one day return to me.",
            "devotionalSurrender": "Krishna, help me act with integrity so that I never fear the consequences of my own actions.",
            "emotions": [
                "fear",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-4",
            "chapter": 1,
            "verse": 4,
            "sanskrit": "अत्र शूरा महेष्वासा भीमार्जुनसमा युधि। युयुधानो विराटश्च द्रुपदश्च महारथः॥",
            "transliteration": "atra śhūrā maheṣhvāsā bhīmārjuna-samā yudhi yuyudhāno virāṭaśhcha drupadaśhcha mahā-rathaḥ",
            "simpleMeaning": "Here are heroes, mighty archers, equal in battle to Bhima and Arjuna: Yuyudhana, Virata, and Drupada, the great warrior.",
            "practicalExplanation": "Duryodhana lists the great warriors on the Pandava side, revealing his anxiety. When we focus obsessively on our competition or enemies, we feed our own fear and insecurity.",
            "strengthReflection": "I will focus on my own strengths rather than obsessing over the abilities of my competitors.",
            "devotionalSurrender": "Lord, free me from the anxiety of comparison. Let me trust in the path You have set for me.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-5",
            "chapter": 1,
            "verse": 5,
            "sanskrit": "धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान्। पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः॥",
            "transliteration": "dhṛiṣhṭaketuśh chekitānaḥ kāśhirājaśhcha vīryavān purujit kuntibhojaśhcha śhaibyaśhcha nara-puṅgavaḥ",
            "simpleMeaning": "There are also Dhrishtaketu, Chekitana, the valiant king of Kashi, Purujit, Kuntibhoja, and Shaibya, the best of men.",
            "practicalExplanation": "The enumeration continues, showing Duryodhana's growing anxiety. When we are insecure, we tend to magnify the strengths of our perceived adversaries.",
            "strengthReflection": "I choose to acknowledge my own capabilities instead of magnifying the strengths of others.",
            "devotionalSurrender": "O Krishna, grant me the confidence that comes from knowing You are always with me.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-6",
            "chapter": 1,
            "verse": 6,
            "sanskrit": "युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान्। सौभद्रो द्रौपदेयाश्च सर्व एव महारथाः॥",
            "transliteration": "yudhāmanyuśhcha vikrānta uttamaujāśhcha vīryavān saubhadro draupadeyāśhcha sarva eva mahā-rathāḥ",
            "simpleMeaning": "The courageous Yudhamanyu, the valiant Uttamauja, the son of Subhadra, and the sons of Draupadi — all are great warriors.",
            "practicalExplanation": "Duryodhana's catalog of enemies shows his fearful state of mind. True courage is not the absence of fear, but the ability to act despite recognizing challenges.",
            "strengthReflection": "I acknowledge the challenges before me, but I will not let fear paralyze my action.",
            "devotionalSurrender": "Lord, let my awareness of challenges drive me to seek Your protection, not to flee in fear.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-7",
            "chapter": 1,
            "verse": 7,
            "sanskrit": "अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम। नायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते॥",
            "transliteration": "asmākaṁ tu viśhiṣhṭā ye tān nibodha dwija-uttama nāyakā mama sainyasya sanjñārthaṁ tān bravīmi te",
            "simpleMeaning": "But know also, O best of the twice-born, the distinguished commanders of my army. I shall name them for your information.",
            "practicalExplanation": "After listing the enemy's strengths, Duryodhana turns to reassure himself by listing his own warriors. Balancing awareness of challenges with recognition of our own resources is key to facing any battle.",
            "strengthReflection": "I take stock of both my challenges and my resources before entering any endeavor.",
            "devotionalSurrender": "Krishna, help me see clearly both the obstacles ahead and the blessings You have given me.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-8",
            "chapter": 1,
            "verse": 8,
            "sanskrit": "भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जयः। अश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च॥",
            "transliteration": "bhavān bhīṣhmaśhcha karṇaśhcha kṛipaśhcha samitiñjayaḥ aśhvatthāmā vikarṇaśhcha saumadattis tathaiva cha",
            "simpleMeaning": "Yourself (Drona), Bhishma, Karna, Kripa who is always victorious in battle, Ashwatthama, Vikarna, and the son of Somadatta.",
            "practicalExplanation": "Duryodhana lists his greatest warriors, seeking comfort in their presence. We often seek external sources of strength and security. True strength comes from within, aligned with dharma.",
            "strengthReflection": "I appreciate my external support systems while cultivating inner strength and resilience.",
            "devotionalSurrender": "Lord, let me find my ultimate security in You, while gratefully accepting the support of noble souls around me.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-9",
            "chapter": 1,
            "verse": 9,
            "sanskrit": "अन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः। नानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः॥",
            "transliteration": "anye cha bahavaḥ śhūrā mad-arthe tyakta-jīvitāḥ nānā-śhastra-praharaṇāḥ sarve yuddha-viśhāradāḥ",
            "simpleMeaning": "And many other heroes who are prepared to give up their lives for my sake, armed with various weapons, all skilled in warfare.",
            "practicalExplanation": "Duryodhana boasts of warriors willing to die for him. True leadership is not measured by those who will die for you, but by those whose lives you enrich and protect.",
            "strengthReflection": "I aspire to lead by serving others, not by demanding their sacrifice for my benefit.",
            "devotionalSurrender": "O Krishna, teach me Your divine leadership — to serve, to protect, and to uplift all beings.",
            "emotions": [
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-10",
            "chapter": 1,
            "verse": 10,
            "sanskrit": "अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम्। पर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम्॥",
            "transliteration": "aparyāptaṁ tad asmākaṁ balaṁ bhīṣhmābhirakṣhitam paryāptaṁ tvidam eteṣhāṁ balaṁ bhīmābhirakṣhitam",
            "simpleMeaning": "Our army, protected by Bhishma, is unlimited, whereas theirs, guarded by Bhima, is limited.",
            "practicalExplanation": "Duryodhana tries to convince himself of his strength, yet his constant comparisons betray his insecurity. Confidence built on comparison is always fragile. True confidence rests in purpose and values.",
            "strengthReflection": "My confidence comes not from being better than others, but from knowing my purpose and values.",
            "devotionalSurrender": "Lord, let my confidence rest in Your guidance, not in fleeting comparisons with others.",
            "emotions": [
                "self-doubt",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-11",
            "chapter": 1,
            "verse": 11,
            "sanskrit": "अयनेषु च सर्वेषु यथाभागमवस्थिताः। भीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि॥",
            "transliteration": "ayaneṣhu cha sarveṣhu yathā-bhāgam avasthitāḥ bhīṣhmam evābhirakṣhantu bhavantaḥ sarva eva hi",
            "simpleMeaning": "Therefore, stationed in your respective positions on all fronts, all of you must now give full support to Bhishma.",
            "practicalExplanation": "Duryodhana instructs his warriors to protect Bhishma. Recognizing and protecting what is most valuable to our cause is essential wisdom in any endeavor.",
            "strengthReflection": "I identify and protect what is most essential to my mission and purpose.",
            "devotionalSurrender": "Krishna, help me discern what is truly important and give it my full protection and attention.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "1-12",
            "chapter": 1,
            "verse": 12,
            "sanskrit": "तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः। सिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान्॥",
            "transliteration": "tasya sañjanayan harṣhaṁ kuru-vṛiddhaḥ pitāmahaḥ siṁha-nādaṁ vinadyochchaiḥ śhaṅkhaṁ dadhmau pratāpavān",
            "simpleMeaning": "Then, Bhishma, the grand old man of the Kuru dynasty, the grandsire, roared like a lion and blew his conch loudly, bringing joy to Duryodhana.",
            "practicalExplanation": "Bhishma's lion-roar reassures Duryodhana. In times of uncertainty, the confidence of respected elders provides strength. Yet Bhishma's support was for the wrong cause, showing that loyalty without righteousness is misguided.",
            "strengthReflection": "I seek guidance from the wise, but I verify that their advice aligns with righteousness.",
            "devotionalSurrender": "O Lord, may I never follow any authority blindly, but always check if the path leads toward dharma.",
            "emotions": [
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-13",
            "chapter": 1,
            "verse": 13,
            "sanskrit": "ततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः। सहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत्॥",
            "transliteration": "tataḥ śhaṅkhāśhcha bheryaśhcha paṇavānaka-gomukhāḥ sahasaivābhyahanyanta sa śhabdas tumulo 'bhavat",
            "simpleMeaning": "Then conches, drums, tabors, trumpets, and horns all suddenly blared forth, and the combined sound was tumultuous.",
            "practicalExplanation": "The sudden burst of war sounds represents the chaos that precedes any great undertaking. Learning to stay centered amidst chaos is essential for success in any endeavor.",
            "strengthReflection": "I will maintain my inner calm even when external circumstances become chaotic and overwhelming.",
            "devotionalSurrender": "Lord Krishna, when the noise of the world overwhelms me, let me find stillness in remembrance of You.",
            "emotions": [
                "fear",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-14",
            "chapter": 1,
            "verse": 14,
            "sanskrit": "ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ। माधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः॥",
            "transliteration": "tataḥ śhvetair hayair yukte mahati syandane sthitau mādhavaḥ pāṇḍavaśhchaiva divyau śhaṅkhau pradadhmatuḥ",
            "simpleMeaning": "Then, seated in a magnificent chariot yoked with white horses, Krishna and Arjuna blew their divine conches.",
            "practicalExplanation": "Krishna and Arjuna enter together — God and devotee, wisdom and action united. When we align ourselves with divine purpose, we become instruments of righteousness.",
            "strengthReflection": "I seek to align my actions with higher purpose, inviting divine wisdom to guide my every step.",
            "devotionalSurrender": "O Madhava, be the charioteer of my life. Guide me through every battle as You guided Arjuna.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "1-15",
            "chapter": 1,
            "verse": 15,
            "sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः। पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः॥",
            "transliteration": "pāñchajanyaṁ hṛiṣhīkeśho devadattaṁ dhanañjayaḥ pauṇḍraṁ dadhmau mahā-śhaṅkhaṁ bhīma-karmā vṛikodaraḥ",
            "simpleMeaning": "Krishna blew His conch Panchajanya, Arjuna blew Devadatta, and Bhima of terrible deeds blew his mighty conch Paundra.",
            "practicalExplanation": "Each conch has a name and story — representing that each of us has a unique voice and role in the world. Discover your unique gift and sound it boldly for righteousness.",
            "strengthReflection": "I recognize and embrace my unique gifts, using them boldly in service of what is right.",
            "devotionalSurrender": "Lord, reveal to me my unique purpose, and give me courage to fulfill it with full dedication.",
            "emotions": [
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-16",
            "chapter": 1,
            "verse": 16,
            "sanskrit": "अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः। नकुलः सहदेवश्च सुघोषमणिपुष्पकौ॥",
            "transliteration": "ananta-vijayaṁ rājā kuntī-putro yudhiṣhṭhiraḥ nakulaḥ sahadevaśhcha sughoṣha-maṇipuṣhpakau",
            "simpleMeaning": "King Yudhishthira, son of Kunti, blew his conch Anantavijaya; Nakula and Sahadeva blew Sughosha and Manipushpaka.",
            "practicalExplanation": "Yudhishthira's conch is named 'Eternal Victory' — reminding us that when we stand for dharma, ultimate victory is assured, though the path may be difficult.",
            "strengthReflection": "I trust that standing for what is right leads to ultimate victory, even if the immediate path is hard.",
            "devotionalSurrender": "Krishna, grant me faith in eventual victory when I walk the path of righteousness.",
            "emotions": [
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-17",
            "chapter": 1,
            "verse": 17,
            "sanskrit": "काश्यश्च परमेष्वासः शिखण्डी च महारथः। धृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः॥",
            "transliteration": "kāśhyaśhcha parameṣhvāsaḥ śhikhaṇḍī cha mahā-rathaḥ dhṛiṣhṭadyumno virāṭaśhcha sātyakiśh chāparājitaḥ",
            "simpleMeaning": "The king of Kashi, the great archer, Shikhandi the mighty warrior, Dhrishtadyumna, Virata, and the invincible Satyaki.",
            "practicalExplanation": "The Pandava army includes warriors of many backgrounds united by dharma. Diversity united in purpose creates unstoppable strength.",
            "strengthReflection": "I value diversity and seek to unite with others around shared righteous purpose.",
            "devotionalSurrender": "Lord, help me see beyond differences and unite with all souls committed to truth and righteousness.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "1-18",
            "chapter": 1,
            "verse": 18,
            "sanskrit": "द्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते। सौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक्॥",
            "transliteration": "drupado draupadeyāśhcha sarvaśhaḥ pṛithivī-pate saubhadraśhcha mahā-bāhuḥ śhaṅkhān dadhmuḥ pṛithak pṛithak",
            "simpleMeaning": "Drupada, the sons of Draupadi, and the mighty-armed Abhimanyu, son of Subhadra, all blew their respective conches, O King.",
            "practicalExplanation": "Each warrior contributes their unique sound to the collective call. In any great endeavor, everyone's contribution matters — there is no small voice when united for truth.",
            "strengthReflection": "I contribute my unique voice and gifts, knowing that every authentic contribution matters.",
            "devotionalSurrender": "O Lord, let me never underestimate my role in Your cosmic plan. Use me as You will.",
            "emotions": [
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "1-19",
            "chapter": 1,
            "verse": 19,
            "sanskrit": "स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत्। नभश्च पृथिवीं चैव तुमुलो व्यनुनादयन्॥",
            "transliteration": "sa ghoṣho dhārtarāṣhṭrāṇāṁ hṛidayāni vyadārayat nabhaśhcha pṛithivīṁ chaiva tumulo vyanunādayan",
            "simpleMeaning": "The tumultuous sound reverberated through the sky and earth, shattering the hearts of Dhritarashtra's sons.",
            "practicalExplanation": "The collective righteous call shattered the confidence of the unrighteous. When truth speaks with one voice, adharma trembles. Unity in righteousness is the greatest force.",
            "strengthReflection": "I add my voice to the collective call for truth and righteousness, knowing our united stand creates powerful change.",
            "devotionalSurrender": "Lord, let the sound of devotion shatter all that is false within me and around me.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-20",
            "chapter": 1,
            "verse": 20,
            "sanskrit": "अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान्कपिध्वजः। प्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डवः॥",
            "transliteration": "atha vyavasthitān dṛiṣhṭvā dhārtarāṣhṭrān kapi-dhvajaḥ pravṛitte śhastra-sampāte dhanur udyamya pāṇḍavaḥ",
            "simpleMeaning": "Then, seeing Dhritarashtra's sons arrayed and the weapons about to be engaged, Arjuna, whose flag bore the emblem of Hanuman, raised his bow.",
            "practicalExplanation": "Arjuna's flag bears Hanuman — symbol of devotion, courage, and service. We each carry symbols of what we value most. What banner do you raise in your battles of life?",
            "strengthReflection": "I consciously choose what values and symbols I identify with, letting them guide my actions.",
            "devotionalSurrender": "O Krishna, let my life be a banner of devotion to You, as Hanuman's image graced Arjuna's flag.",
            "emotions": [
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-21",
            "chapter": 1,
            "verse": 21,
            "sanskrit": "हृषीकेशं तदा वाक्यमिदमाह महीपते। अर्जुन उवाच। सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत॥",
            "transliteration": "hṛiṣhīkeśhaṁ tadā vākyam idam āha mahī-pate arjuna uvācha senayor ubhayor madhye rathaṁ sthāpaya me 'chyuta",
            "simpleMeaning": "Arjuna said to Krishna: O Infallible One, please draw my chariot between the two armies.",
            "practicalExplanation": "Arjuna asks Krishna to place him between the two forces — seeking clarity before action. Before any major decision, pause and observe. See the full picture before acting.",
            "strengthReflection": "Before important decisions, I pause to see the complete picture from all angles.",
            "devotionalSurrender": "O Achyuta, the Infallible One, guide my chariot of life. Help me see clearly before I act.",
            "emotions": [
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-22",
            "chapter": 1,
            "verse": 22,
            "sanskrit": "यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान्। कैर्मया सह योद्धव्यमस्मिन्रणसमुद्यमे॥",
            "transliteration": "yāvad etān nirīkṣhe 'haṁ yoddhu-kāmān avasthitān kair mayā saha yoddhavyam asmin raṇa-samudyame",
            "simpleMeaning": "So that I may see those who stand here eager to fight, with whom I must engage in this great battle.",
            "practicalExplanation": "Arjuna wants to identify his opponents clearly. Knowing exactly what we're facing — our real challenges and adversaries — is essential before any battle begins.",
            "strengthReflection": "I clearly identify my challenges and obstacles before engaging with them.",
            "devotionalSurrender": "Lord, grant me clarity to see what I must truly overcome in my life's battles.",
            "emotions": [
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-23",
            "chapter": 1,
            "verse": 23,
            "sanskrit": "योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः। धार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः॥",
            "transliteration": "yotsyamānān avekṣhe 'haṁ ya ete 'tra samāgatāḥ dhārtarāṣhṭrasya durbuddher yuddhe priya-chikīrṣhavaḥ",
            "simpleMeaning": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra.",
            "practicalExplanation": "Arjuna identifies those supporting adharma as 'evil-minded.' Yet these include his own relatives. Sometimes our greatest opponents are those closest to us who have chosen wrong paths.",
            "strengthReflection": "I accept that sometimes those closest to me may oppose what is right, and I must still stand for truth.",
            "devotionalSurrender": "O Krishna, give me strength to uphold dharma even when those I love stand on the other side.",
            "emotions": [
                "duty",
                "attachment",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-24",
            "chapter": 1,
            "verse": 24,
            "sanskrit": "सञ्जय उवाच। एवमुक्तो हृषीकेशो गुडाकेशेन भारत। सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम्॥",
            "transliteration": "sañjaya uvācha evam ukto hṛiṣhīkeśho guḍākeśhena bhārata senayor ubhayor madhye sthāpayitvā rathottamam",
            "simpleMeaning": "Sanjaya said: O Dhritarashtra, having been thus addressed by Arjuna, Krishna drew the magnificent chariot between the two armies.",
            "practicalExplanation": "Krishna complies with Arjuna's request without question or judgment. A true guide positions us to see clearly, letting us draw our own conclusions and make our own choices.",
            "strengthReflection": "I seek guides who help me see clearly rather than those who tell me what to think.",
            "devotionalSurrender": "Lord, position me where I need to be to see the truth of my situation clearly.",
            "emotions": [
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-25",
            "chapter": 1,
            "verse": 25,
            "sanskrit": "भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम्। उवाच पार्थ पश्यैतान्समवेतान्कुरूनिति॥",
            "transliteration": "bhīṣhma-droṇa-pramukhataḥ sarveṣhāṁ cha mahī-kṣhitām uvācha pārtha paśhyaitān samavetān kurūn iti",
            "simpleMeaning": "In the presence of Bhishma, Drona, and all the rulers of the earth, Krishna said: O Partha, behold all the Kurus assembled here.",
            "practicalExplanation": "Krishna simply says 'Behold' — He doesn't interpret, judge, or advise. Sometimes the greatest gift a guide gives is simply helping us see what is, without bias or direction.",
            "strengthReflection": "I cultivate the ability to observe situations clearly, without rushing to judgment or reaction.",
            "devotionalSurrender": "O Krishna, help me simply see what is, with clarity and without the distortions of my desires and fears.",
            "emotions": [
                "overthinking",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "1-26",
            "chapter": 1,
            "verse": 26,
            "sanskrit": "तत्रापश्यत्स्थितान्पार्थः पितृनथ पितामहान्। आचार्यान्मातुलान्भ्रातृन्पुत्रान्पौत्रान्सखींस्तथा॥",
            "transliteration": "tatrāpaśhyat sthitān pārthaḥ pitṝīn atha pitāmahān āchāryān mātulān bhrātṝīn putrān pautrān sakhīṁs tathā",
            "simpleMeaning": "There Arjuna saw stationed fathers, grandfathers, teachers, maternal uncles, brothers, sons, grandsons, and friends.",
            "practicalExplanation": "Arjuna sees his own family on the opposing side. Life's most challenging battles are often against those we love — our own attachments, relationships, and comfort zones.",
            "strengthReflection": "I recognize that my greatest challenges often involve those closest to me, and I prepare myself accordingly.",
            "devotionalSurrender": "Lord, when I must stand against those I love for righteousness, give me courage and compassion.",
            "emotions": [
                "attachment",
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-27",
            "chapter": 1,
            "verse": 27,
            "sanskrit": "श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि। तान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान्॥",
            "transliteration": "śhvaśhurān suhṛidaśh chaiva senayor ubhayor api tān samīkṣhya sa kaunteyaḥ sarvān bandhūn avasthitān",
            "simpleMeaning": "He also saw fathers-in-law and well-wishers in both armies. Seeing all his kinsmen arrayed there.",
            "practicalExplanation": "Arjuna sees relatives on both sides — a reminder that in most conflicts, there are loved ones everywhere. True wisdom sees the humanity in all, even in conflict.",
            "strengthReflection": "Even in conflict, I remember the humanity of those on the other side.",
            "devotionalSurrender": "Krishna, help me see all beings as Your children, even when circumstances place us in opposition.",
            "emotions": [
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-28",
            "chapter": 1,
            "verse": 28,
            "sanskrit": "कृपया परयाविष्टो विषीदन्निदमब्रवीत्। अर्जुन उवाच। दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम्॥",
            "transliteration": "kṛipayā parayāviṣhṭo viṣhīdann idam abravīt arjuna uvācha dṛiṣhṭvemaṁ sva-janaṁ kṛiṣhṇa yuyutsuṁ samupasthitam",
            "simpleMeaning": "Arjuna, filled with deep compassion, spoke in grief: O Krishna, seeing my own kinsmen arrayed and eager to fight.",
            "practicalExplanation": "Arjuna's compassion overwhelms him — his heart breaks at the thought of harming loved ones. Compassion is beautiful, but when it paralyzes action against adharma, it becomes a weakness disguised as virtue.",
            "strengthReflection": "I balance my compassion with the courage to act against wrongdoing, even when it's difficult.",
            "devotionalSurrender": "Lord, purify my compassion so it doesn't blind me to my duty or paralyze righteous action.",
            "emotions": [
                "attachment",
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-29",
            "chapter": 1,
            "verse": 29,
            "sanskrit": "सीदन्ति मम गात्राणि मुखं च परिशुष्यति। वेपथुश्च शरीरे मे रोमहर्षश्च जायते॥",
            "transliteration": "sīdanti mama gātrāṇi mukhaṁ cha pariśhuṣhyati vepathuśh cha śharīre me roma-harṣhaśh cha jāyate",
            "simpleMeaning": "My limbs are failing, my mouth is drying up, my body trembles, and my hair stands on end.",
            "practicalExplanation": "Arjuna experiences physical symptoms of anxiety — trembling, dry mouth, weakness. Our bodies reflect our mental state. Recognizing these signals helps us address the underlying emotional turmoil.",
            "strengthReflection": "I pay attention to my body's signals of stress and address the underlying emotional causes.",
            "devotionalSurrender": "O Krishna, when anxiety overwhelms my body, let remembrance of You be my anchor of calm.",
            "emotions": [
                "fear",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-30",
            "chapter": 1,
            "verse": 30,
            "sanskrit": "गाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते। न च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः॥",
            "transliteration": "gāṇḍīvaṁ sraṁsate hastāt tvak chaiva paridahyate na cha śhaknomy avasthātuṁ bhramatīva cha me manaḥ",
            "simpleMeaning": "The Gandiva bow slips from my hand, my skin burns all over, I am unable to stand, and my mind is reeling.",
            "practicalExplanation": "Arjuna, the greatest archer, cannot hold his bow. Even the most skilled among us can be rendered helpless by inner turmoil. Mastery of skills is useless without mastery of mind.",
            "strengthReflection": "I prioritize mastery of my mind alongside mastery of my skills.",
            "devotionalSurrender": "Lord, when my trained abilities fail me, let my surrender to You be my strength.",
            "emotions": [
                "fear",
                "self-doubt",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-31",
            "chapter": 1,
            "verse": 31,
            "sanskrit": "निमित्तानि च पश्यामि विपरीतानि केशव। न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे॥",
            "transliteration": "nimittāni cha paśhyāmi viparītāni keśhava na cha śhreyo 'nupaśhyāmi hatvā sva-janam āhave",
            "simpleMeaning": "I see ominous signs, O Krishna. I do not see any good coming from killing my own kinsmen in battle.",
            "practicalExplanation": "Arjuna interprets normal events as bad omens — a sign of a mind seeking justification for withdrawal. When we want to avoid something, we find reasons everywhere.",
            "strengthReflection": "I examine whether my reasoning is genuine wisdom or fear-based justification.",
            "devotionalSurrender": "Krishna, give me clarity to distinguish between true intuition and fear dressed as wisdom.",
            "emotions": [
                "fear",
                "overthinking",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "1-32",
            "chapter": 1,
            "verse": 32,
            "sanskrit": "न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च। किं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा॥",
            "transliteration": "na kāṅkṣhe vijayaṁ kṛiṣhṇa na cha rājyaṁ sukhāni cha kiṁ no rājyena govinda kiṁ bhogair jīvitena vā",
            "simpleMeaning": "I do not desire victory, O Krishna, nor kingdom, nor pleasures. Of what use is kingdom to us, O Govinda? Of what use are enjoyments or even life itself?",
            "practicalExplanation": "Arjuna renounces desire for victory and kingdom — seemingly noble, but actually an escape from duty. False renunciation born of weakness is not true detachment.",
            "strengthReflection": "I distinguish between genuine detachment and escapism disguised as spiritual renunciation.",
            "devotionalSurrender": "Lord, save me from the false renunciation that avoids duty rather than transcending attachment.",
            "emotions": [
                "attachment",
                "self-doubt",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-33",
            "chapter": 1,
            "verse": 33,
            "sanskrit": "येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च। त इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च॥",
            "transliteration": "yeṣhām arthe kāṅkṣhitaṁ no rājyaṁ bhogāḥ sukhāni cha ta ime 'vasthitā yuddhe prāṇāṁs tyaktvā dhanāni cha",
            "simpleMeaning": "Those for whose sake we desire kingdom, enjoyments, and pleasures — they stand here in battle, ready to give up their lives and wealth.",
            "practicalExplanation": "Arjuna realizes everything he would win is for people he might have to kill. This reveals the deeper truth — all external gains are empty when disconnected from love and relationship.",
            "strengthReflection": "I remember that external achievements are meaningful only in context of the relationships and values they serve.",
            "devotionalSurrender": "O Krishna, let my pursuits always serve love, connection, and dharma, not just empty achievement.",
            "emotions": [
                "attachment",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-34",
            "chapter": 1,
            "verse": 34,
            "sanskrit": "आचार्याः पितरः पुत्रास्तथैव च पितामहाः। मातुलाः श्वशुराः पौत्राः श्यालाः सम्बन्धिनस्तथा॥",
            "transliteration": "āchāryāḥ pitaraḥ putrās tathaiva cha pitāmahāḥ mātulāḥ śhvaśhurāḥ pautrāḥ śhyālāḥ sambandhinas tathā",
            "simpleMeaning": "Teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law, and other kinsmen.",
            "practicalExplanation": "Arjuna lists all the relationships at stake. Our lives are webs of connection. Any significant action affects many people in ways we may not fully anticipate.",
            "strengthReflection": "I consider the broader impact of my actions on my network of relationships.",
            "devotionalSurrender": "Lord, guide me to act in ways that honor all my sacred relationships, while still serving truth.",
            "emotions": [
                "attachment",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-35",
            "chapter": 1,
            "verse": 35,
            "sanskrit": "एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन। अपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते॥",
            "transliteration": "etān na hantum ichchhāmi ghnato 'pi madhusūdana api trailokya-rājyasya hetoḥ kiṁ nu mahī-kṛite",
            "simpleMeaning": "I do not wish to kill them, O Madhusudana, even if they attack me first — not even for sovereignty over the three worlds, much less for this earth.",
            "practicalExplanation": "Arjuna would rather be killed than kill his kinsmen. This seems noble but ignores that his enemies represent adharma. Sometimes protecting truth requires fighting those we love.",
            "strengthReflection": "I accept that protecting what is right may require difficult choices regarding those I care about.",
            "devotionalSurrender": "O Slayer of Madhu, give me strength to do what is right, even when it breaks my heart.",
            "emotions": [
                "attachment",
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-36",
            "chapter": 1,
            "verse": 36,
            "sanskrit": "निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन। पापमेवाश्रयेदस्मान्हत्वैतानाततायिनः॥",
            "transliteration": "nihatya dhārtarāṣhṭrān naḥ kā prītiḥ syāj janārdana pāpam evāśhrayed asmān hatvaitān ātatāyinaḥ",
            "simpleMeaning": "What pleasure would we derive from killing the sons of Dhritarashtra, O Janardana? Sin alone would accrue to us by slaying these aggressors.",
            "practicalExplanation": "Arjuna fears the sin of killing. Yet scripture permits the killing of aggressors in defense of dharma. His selective use of scripture reveals rationalization, not wisdom.",
            "strengthReflection": "I apply principles consistently, not selectively to justify what I already want to do.",
            "devotionalSurrender": "Lord, save me from twisting sacred teachings to serve my comfort rather than truth.",
            "emotions": [
                "fear",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-37",
            "chapter": 1,
            "verse": 37,
            "sanskrit": "तस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान्। स्वजनं हि कथं हत्वा सुखिनः स्याम माधव॥",
            "transliteration": "tasmān nārhā vayaṁ hantuṁ dhārtarāṣhṭrān sva-bāndhavān sva-janaṁ hi kathaṁ hatvā sukhinaḥ syāma mādhava",
            "simpleMeaning": "Therefore, it is not proper for us to kill the sons of Dhritarashtra, our own kinsmen. How can we be happy after killing our own people, O Madhava?",
            "practicalExplanation": "Arjuna equates happiness with avoiding difficult duty. True and lasting happiness comes from alignment with dharma, not from escaping challenging responsibilities.",
            "strengthReflection": "I seek happiness through righteous action, not through avoidance of difficult duties.",
            "devotionalSurrender": "O Madhava, teach me that true joy flows from doing Your will, not from my comfort.",
            "emotions": [
                "attachment",
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-38",
            "chapter": 1,
            "verse": 38,
            "sanskrit": "यद्यप्येते न पश्यन्ति लोभोपहतचेतसः। कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम्॥",
            "transliteration": "yady apy ete na paśhyanti lobhopahata-chetasaḥ kula-kṣhaya-kṛitaṁ doṣhaṁ mitra-drohe cha pātakam",
            "simpleMeaning": "Even if these men, their minds overcome by greed, do not see the sin in destroying their own family and the crime in treachery to friends.",
            "practicalExplanation": "Arjuna claims moral superiority — others are blind to sin while he sees clearly. Yet in his confusion, he too is blind to his duty. Judging others often reveals our own blind spots.",
            "strengthReflection": "Before judging others' blindness, I examine my own areas of confusion and denial.",
            "devotionalSurrender": "Lord, remove the beam from my own eye before I focus on the speck in my brother's.",
            "emotions": [
                "overthinking",
                "duty",
                "anger"
            ],
            "audioUrl": null
        },
        {
            "id": "1-39",
            "chapter": 1,
            "verse": 39,
            "sanskrit": "कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम्। कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन॥",
            "transliteration": "kathaṁ na jñeyam asmābhiḥ pāpād asmān nivartitum kula-kṣhaya-kṛitaṁ doṣhaṁ prapaśhyadbhir janārdana",
            "simpleMeaning": "Why should we, who clearly see the sin in the destruction of the family, not turn away from this sin, O Janardana?",
            "practicalExplanation": "Arjuna uses 'wisdom' as an excuse for inaction. Seeing a problem is not the same as wisdom — true wisdom includes right action. Analysis paralysis is a luxury dharma cannot afford.",
            "strengthReflection": "I move from analysis to action, knowing that insight without action is incomplete wisdom.",
            "devotionalSurrender": "O Krishna, transform my understanding into committed action. Save me from endless deliberation.",
            "emotions": [
                "overthinking",
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "1-40",
            "chapter": 1,
            "verse": 40,
            "sanskrit": "कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः। धर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत॥",
            "transliteration": "kula-kṣhaye praṇaśhyanti kula-dharmāḥ sanātanāḥ dharme naṣhṭe kulaṁ kṛitsnam adharmo 'bhibhavaty uta",
            "simpleMeaning": "In the destruction of the family, the eternal family traditions perish. When dharma is lost, adharma overwhelms the entire family.",
            "practicalExplanation": "Arjuna argues that war destroys tradition and dharma. Yet he ignores that the Kauravas have already destroyed dharma. Sometimes war is the medicine, not the disease.",
            "strengthReflection": "I see beyond immediate effects to understand the deeper causes and consequences of situations.",
            "devotionalSurrender": "Lord, give me wisdom to distinguish between protecting traditions and protecting the truth they were meant to serve.",
            "emotions": [
                "fear",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-41",
            "chapter": 1,
            "verse": 41,
            "sanskrit": "अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः। स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्करः॥",
            "transliteration": "adharmābhibhavāt kṛiṣhṇa praduṣhyanti kula-striyaḥ strīṣhu duṣhṭāsu vārṣhṇeya jāyate varṇa-saṅkaraḥ",
            "simpleMeaning": "With the predominance of adharma, O Krishna, the women of the family become corrupted. From the corruption of women, O Varshneya, comes unwanted progeny.",
            "practicalExplanation": "Arjuna speaks of protecting women and tradition, but his argument reflects attachment masquerading as protection. True protection comes through upholding dharma, not avoiding duty.",
            "strengthReflection": "I protect what I love through righteous action, not through avoidance of difficult responsibilities.",
            "devotionalSurrender": "O Varshneya, help me understand that true protection flows from dharma, not from running from duty.",
            "emotions": [
                "fear",
                "attachment",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-42",
            "chapter": 1,
            "verse": 42,
            "sanskrit": "सङ्करो नरकायैव कुलघ्नानां कुलस्य च। पतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः॥",
            "transliteration": "saṅkaro narakāyaiva kula-ghnānāṁ kulasya cha patanti pitaro hy eṣhāṁ lupta-piṇḍodaka-kriyāḥ",
            "simpleMeaning": "Such social confusion leads to hell for the family destroyers and for the family. The ancestors fall, deprived of their offerings of food and water.",
            "practicalExplanation": "Arjuna fears ancestral consequences. Honoring ancestors is important, yet they would not want their descendants to abandon dharma out of misguided reverence for ritual.",
            "strengthReflection": "I honor my ancestors best by living with integrity and fulfilling my duties courageously.",
            "devotionalSurrender": "Lord, let me honor those who came before me by upholding the dharma they valued.",
            "emotions": [
                "fear",
                "attachment",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-43",
            "chapter": 1,
            "verse": 43,
            "sanskrit": "दोषैरेतैः कुलघ्नानां वर्णसङ्करकारकैः। उत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः॥",
            "transliteration": "doṣhair etaiḥ kula-ghnānāṁ varṇa-saṅkara-kārakaiḥ utsādyante jāti-dharmāḥ kula-dharmāśh cha śhāśhvatāḥ",
            "simpleMeaning": "By the misdeeds of those who destroy the family and create social confusion, the eternal community and family traditions are destroyed.",
            "practicalExplanation": "Arjuna fears the loss of tradition. Yet clinging to traditions that protect adharma is itself a violation of the deeper purpose those traditions were meant to serve.",
            "strengthReflection": "I honor the spirit of traditions, not their letter, when the two come into conflict.",
            "devotionalSurrender": "O Krishna, help me distinguish between essence and form in all the traditions I hold dear.",
            "emotions": [
                "duty",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "1-44",
            "chapter": 1,
            "verse": 44,
            "sanskrit": "उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन। नरके नियतं वासो भवतीत्यनुशुश्रुम॥",
            "transliteration": "utsanna-kula-dharmāṇāṁ manuṣhyāṇāṁ janārdana narake niyataṁ vāso bhavatīty anuśhuśhruma",
            "simpleMeaning": "O Janardana, we have heard that those whose family traditions are destroyed dwell in hell indefinitely.",
            "practicalExplanation": "Arjuna quotes scripture about hell, yet selectively. Scripture also prescribes that warriors must fight for dharma. Selective quoting serves confusion, not clarity.",
            "strengthReflection": "I seek complete understanding of wisdom teachings, not selective interpretations that serve my preferences.",
            "devotionalSurrender": "Lord, save me from using sacred teachings to justify what I already want to do.",
            "emotions": [
                "fear",
                "overthinking",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-45",
            "chapter": 1,
            "verse": 45,
            "sanskrit": "अहो बत महत्पापं कर्तुं व्यवसिता वयम्। यद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः॥",
            "transliteration": "aho bata mahat pāpaṁ kartuṁ vyavasitā vayam yad rājya-sukha-lobhena hantuṁ sva-janam udyatāḥ",
            "simpleMeaning": "Alas! We are resolved to commit great sin, being prepared to kill our own kinsmen out of greed for royal happiness.",
            "practicalExplanation": "Arjuna condemns himself for greed, yet his presence at the war is not about greed — it's about reclaiming what was stolen through adharma. Self-criticism can be as misguided as self-praise.",
            "strengthReflection": "I examine my motives honestly, neither inflating nor unfairly condemning them.",
            "devotionalSurrender": "O Lord, help me see my true motivations clearly, beyond both self-justification and false guilt.",
            "emotions": [
                "self-doubt",
                "overthinking",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "1-46",
            "chapter": 1,
            "verse": 46,
            "sanskrit": "यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः। धार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत्॥",
            "transliteration": "yadi mām apratīkāram aśhastraṁ śhastra-pāṇayaḥ dhārtarāṣhṭrā raṇe hanyus tan me kṣhemataraṁ bhavet",
            "simpleMeaning": "It would be better for me if the sons of Dhritarashtra, with weapons in hand, were to kill me unarmed and unresisting in battle.",
            "practicalExplanation": "Arjuna would rather die than fight — the ultimate escape from duty. This is not courage or sacrifice; it is sophisticated avoidance wearing spiritual clothes.",
            "strengthReflection": "I recognize that giving up can sometimes masquerade as sacrifice or spiritual surrender.",
            "devotionalSurrender": "Krishna, save me from confusing cowardice with renunciation, escape with detachment.",
            "emotions": [
                "fear",
                "self-doubt",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "1-47",
            "chapter": 1,
            "verse": 47,
            "sanskrit": "सञ्जय उवाच। एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
            "transliteration": "sañjaya uvācha evam uktvārjunaḥ saṅkhye rathopastha upāviśhat visṛijya sa-śharaṁ chāpaṁ śhoka-saṁvigna-mānasaḥ",
            "simpleMeaning": "Sanjaya said: Having spoken thus on the battlefield, Arjuna cast aside his bow and arrows, and sat down on the chariot, his mind overwhelmed with grief.",
            "practicalExplanation": "The great warrior sits down, defeated not by an enemy but by his own mind. This is the human condition — our greatest battles are internal. Yet this collapse becomes the doorway to divine wisdom in the chapters to come.",
            "strengthReflection": "I accept that my lowest moments can become doorways to my greatest transformation.",
            "devotionalSurrender": "O Lord, when I collapse under the weight of my confusion, use that moment to pour Your wisdom into my emptied heart.",
            "emotions": [
                "fear",
                "self-doubt",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-1",
            "chapter": 2,
            "verse": 1,
            "sanskrit": "सञ्जय उवाच। तं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्। विषीदन्तमिदं वाक्यमुवाच मधुसूदनः॥",
            "transliteration": "sañjaya uvācha taṁ tathā kṛipayāviṣhṭam aśhru-pūrṇākulekṣhaṇam viṣhīdantam idaṁ vākyam uvācha madhusūdanaḥ",
            "simpleMeaning": "Sanjaya said: To him who was thus overcome with pity, whose eyes were filled with tears and troubled, and who was despairing, Madhusudana spoke these words.",
            "practicalExplanation": "Krishna sees Arjuna in complete breakdown - tearful, confused, despairing. Yet He does not judge or abandon him. This is the moment before transformation. Our lowest points often precede our greatest awakenings.",
            "strengthReflection": "I accept that breakdowns can become breakthroughs when I remain open to guidance.",
            "devotionalSurrender": "O Madhusudana, in my moments of despair, speak to me as You spoke to Arjuna.",
            "emotions": [
                "fear",
                "self-doubt",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-2",
            "chapter": 2,
            "verse": 2,
            "sanskrit": "श्रीभगवानुवाच। कुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्। अनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥",
            "transliteration": "śhrī bhagavān uvācha kutastvā kaśhmalam idaṁ viṣhame samupasthitam anārya-juṣhṭam asvargyam akīrti-karam arjuna",
            "simpleMeaning": "The Supreme Lord said: From where has this weakness come upon you at this critical hour? It is not befitting noble souls, nor does it lead to heaven, and it causes disgrace, O Arjuna.",
            "practicalExplanation": "Krishna's first words are a challenge, not comfort. Sometimes we need to be shaken from our self-pity. True compassion isn't always soft - it calls us to rise above our excuses.",
            "strengthReflection": "I welcome the voices that challenge me to rise, not just those that comfort me in weakness.",
            "devotionalSurrender": "Lord, shake me from my comfortable excuses. Call me to the greatness You see in me.",
            "emotions": [
                "self-doubt",
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-3",
            "chapter": 2,
            "verse": 3,
            "sanskrit": "क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते। क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप॥",
            "transliteration": "klaibyaṁ mā sma gamaḥ pārtha naitat tvayyupapadyate kṣhudraṁ hṛidaya-daurbalyaṁ tyaktvottiṣhṭha parantapa",
            "simpleMeaning": "Do not yield to unmanliness, O Partha. It does not befit you. Cast off this petty weakness of heart and arise, O scorcher of enemies!",
            "practicalExplanation": "Krishna commands Arjuna to reject weakness. The word 'klaibyam' means impotence of will. Our potential remains dormant when we surrender to weakness. Rise! is the eternal call.",
            "strengthReflection": "I reject the comfortable identity of weakness. I choose to rise and become who I am meant to be.",
            "devotionalSurrender": "O Parantapa, burn away my weakness with the fire of Your divine call. Help me arise!",
            "emotions": [
                "self-doubt",
                "fear",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-4",
            "chapter": 2,
            "verse": 4,
            "sanskrit": "अर्जुन उवाच। कथं भीष्ममहं सङ्ख्ये द्रोणं च मधुसूदन। इषुभिः प्रतियोत्स्यामि पूजार्हावरिसूदन॥",
            "transliteration": "arjuna uvācha kathaṁ bhīṣhmam ahaṁ saṅkhye droṇaṁ cha madhusūdana iṣhubhiḥ pratiyotsyāmi pūjārhāv ari-sūdana",
            "simpleMeaning": "Arjuna said: O Madhusudana, how can I fight with arrows against Bhishma and Drona in battle? They are worthy of my worship, O destroyer of enemies.",
            "practicalExplanation": "Arjuna's question reveals the complexity of life - sometimes we must oppose those we respect. Respect for elders doesn't mean following them into adharma.",
            "strengthReflection": "I can honor and respect people while still standing firm against their wrong actions.",
            "devotionalSurrender": "Lord, give me wisdom to honor what deserves honor while opposing what must be opposed.",
            "emotions": [
                "duty",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-5",
            "chapter": 2,
            "verse": 5,
            "sanskrit": "गुरूनहत्वा हि महानुभावान् श्रेयो भोक्तुं भैक्ष्यमपीह लोके। हत्वार्थकामांस्तु गुरूनिहैव भुञ्जीय भोगान् रुधिरप्रदिग्धान्॥",
            "transliteration": "gurūn ahatvā hi mahānubhāvān śhreyo bhoktuṁ bhaikṣhyam apīha loke hatvārtha-kāmāṁs tu gurūn ihaiva bhuñjīya bhogān rudhira-pradigdhān",
            "simpleMeaning": "It would be better to live in this world by begging than to slay these great souls who are my teachers. If I kill them, all my enjoyments will be tainted with blood.",
            "practicalExplanation": "Arjuna prefers poverty to fighting his teachers. This seems noble but ignores that these teachers chose the wrong side. Misplaced loyalty perpetuates adharma.",
            "strengthReflection": "I examine whether my loyalties serve truth or merely serve my comfort and sentiment.",
            "devotionalSurrender": "Krishna, help me place loyalty to dharma above loyalty to personalities.",
            "emotions": [
                "attachment",
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-6",
            "chapter": 2,
            "verse": 6,
            "sanskrit": "न चैतद्विद्मः कतरन्नो गरीयो यद्वा जयेम यदि वा नो जयेयुः। यानेव हत्वा न जिजीविषामस्तेऽवस्थिताः प्रमुखे धार्तराष्ट्राः॥",
            "transliteration": "na chaitad vidmaḥ kataran no garīyo yad vā jayema yadi vā no jayeyuḥ yān eva hatvā na jijīviṣhāmas te 'vasthitāḥ pramukhe dhārtarāṣhṭrāḥ",
            "simpleMeaning": "We do not know which is better - to conquer them or be conquered by them. The sons of Dhritarashtra, killing whom we would not wish to live, stand before us.",
            "practicalExplanation": "Arjuna admits complete confusion - he doesn't know what's better. This honest acknowledgment of confusion is actually progress. From 'I know better' to 'I don't know' opens the door to learning.",
            "strengthReflection": "I admit when I don't know, making space for genuine learning and guidance.",
            "devotionalSurrender": "Lord, I confess my confusion. In not knowing, I become ready to receive Your wisdom.",
            "emotions": [
                "overthinking",
                "self-doubt",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-7",
            "chapter": 2,
            "verse": 7,
            "sanskrit": "कार्पण्यदोषोपहतस्वभावः पृच्छामि त्वां धर्मसम्मूढचेताः। यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्॥",
            "transliteration": "kārpaṇya-doṣhopahata-svabhāvaḥ pṛichchhāmi tvāṁ dharma-sammūḍha-chetāḥ yach-chhreyaḥ syān niśhchitaṁ brūhi tan me śhiṣhyas te 'haṁ śhādhi māṁ tvāṁ prapannam",
            "simpleMeaning": "My heart is afflicted by weakness and my mind is confused about dharma. Tell me decisively what is best for me. I am Your disciple. Instruct me, for I have surrendered to You.",
            "practicalExplanation": "This is Arjuna's true surrender - admitting weakness, confusion, and asking for guidance. This verse marks the real beginning of the Gita's teaching. Surrender to a true guide opens the floodgates of wisdom.",
            "strengthReflection": "I embrace being a student. In surrendering my confusion to wise guidance, I find clarity.",
            "devotionalSurrender": "O Krishna, I am Your disciple. My heart is weak, my mind confused. Teach me. I surrender to You.",
            "emotions": [
                "self-doubt",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-8",
            "chapter": 2,
            "verse": 8,
            "sanskrit": "न हि प्रपश्यामि ममापनुद्याद्यच्छोकमुच्छोषणमिन्द्रियाणाम्। अवाप्य भूमावसपत्नमृद्धं राज्यं सुराणामपि चाधिपत्यम्॥",
            "transliteration": "na hi prapaśhyāmi mamāpanudyād yach-chhokam uchchhoṣhaṇam indriyāṇām avāpya bhūmāv asapatnam ṛiddhaṁ rājyaṁ surāṇām api chādhipatyam",
            "simpleMeaning": "I see nothing that can remove this grief which is drying up my senses, even if I were to attain unrivaled and prosperous kingdom on earth, or even sovereignty over the gods.",
            "practicalExplanation": "Arjuna realizes no external achievement can cure inner grief. This is profound insight - no kingdom, no success, no power can fill the void of a troubled soul. Only inner transformation brings peace.",
            "strengthReflection": "I seek inner peace knowing that external achievements alone cannot heal my deepest struggles.",
            "devotionalSurrender": "Lord, no worldly gain can give me what I truly seek. Only You can remove the grief of my soul.",
            "emotions": [
                "self-doubt",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-9",
            "chapter": 2,
            "verse": 9,
            "sanskrit": "सञ्जय उवाच। एवमुक्त्वा हृषीकेशं गुडाकेशः परन्तपः। न योत्स्य इति गोविन्दमुक्त्वा तूष्णीं बभूव ह॥",
            "transliteration": "sañjaya uvācha evam uktvā hṛiṣhīkeśhaṁ guḍākeśhaḥ parantapaḥ na yotsya iti govindam uktvā tūṣhṇīṁ babhūva ha",
            "simpleMeaning": "Sanjaya said: Having spoken thus to Krishna, Arjuna, the conqueror of sleep and scorcher of enemies, said 'I will not fight' and became silent.",
            "practicalExplanation": "Arjuna declares 'I will not fight' and falls silent. His declaration seems final, but his silence creates space for Krishna's teaching. Sometimes we must exhaust our arguments before we can truly listen.",
            "strengthReflection": "I recognize when I've exhausted my own understanding and need to become silent and receptive.",
            "devotionalSurrender": "O Govinda, I have said all I can say. Now I am silent. Speak to me.",
            "emotions": [
                "self-doubt",
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-10",
            "chapter": 2,
            "verse": 10,
            "sanskrit": "तमुवाच हृषीकेशः प्रहसन्निव भारत। सेनयोरुभयोर्मध्ये विषीदन्तमिदं वचः॥",
            "transliteration": "tam uvācha hṛiṣhīkeśhaḥ prahasann iva bhārata senayor ubhayor madhye viṣhīdantam idaṁ vachaḥ",
            "simpleMeaning": "O Dhritarashtra, to the grieving Arjuna, between the two armies, Krishna, smiling as it were, spoke these words.",
            "practicalExplanation": "Krishna smiles at Arjuna's despair - not mockingly, but with the compassion of one who sees beyond the confusion. The smile of the divine is reassurance that all will be well, that confusion is temporary.",
            "strengthReflection": "I trust that behind my confusion, there is a larger wisdom guiding me toward clarity.",
            "devotionalSurrender": "Lord, smile upon my confusion. Let Your joy remind me that this too shall pass.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-11",
            "chapter": 2,
            "verse": 11,
            "sanskrit": "श्रीभगवानुवाच। अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥",
            "transliteration": "śhrī bhagavān uvācha aśhochyān anvaśhochas tvaṁ prajñā-vādānśh cha bhāṣhase gatāsūn agatāsūnśh cha nānuśhochanti paṇḍitāḥ",
            "simpleMeaning": "The Supreme Lord said: You grieve for those who should not be grieved for, yet you speak words of wisdom. The wise grieve neither for the living nor for the dead.",
            "practicalExplanation": "Krishna points out Arjuna's contradiction - speaking wisely while acting foolishly. True wisdom is demonstrated through action, not just words. The wise understand the eternal nature of the soul and do not mourn.",
            "strengthReflection": "I align my actions with my understanding, closing the gap between what I know and what I do.",
            "devotionalSurrender": "O Lord, transform my intellectual understanding into lived wisdom. Let my actions match my words.",
            "emotions": [
                "overthinking",
                "attachment",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-12",
            "chapter": 2,
            "verse": 12,
            "sanskrit": "न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः। न चैव न भविष्यामः सर्वे वयमतः परम्॥",
            "transliteration": "na tvevāhaṁ jātu nāsaṁ na tvaṁ neme janādhipāḥ na chaiva na bhaviṣhyāmaḥ sarve vayam ataḥ param",
            "simpleMeaning": "Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
            "practicalExplanation": "Krishna reveals the eternal nature of the soul. We have always existed and always will. Death is merely a transition, not an ending. Understanding this removes the fear that paralyzes action.",
            "strengthReflection": "I am eternal. This body is temporary, but my essence continues. I act without fear of death.",
            "devotionalSurrender": "O Eternal One, help me remember my own eternal nature, free from the fear of endings.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-13",
            "chapter": 2,
            "verse": 13,
            "sanskrit": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
            "transliteration": "dehino 'smin yathā dehe kaumāraṁ yauvanaṁ jarā tathā dehāntara-prāptir dhīras tatra na muhyati",
            "simpleMeaning": "Just as the soul passes through childhood, youth, and old age in this body, so too does it pass to another body. The wise are not confused by this.",
            "practicalExplanation": "Death is compared to growing older - a natural transition. Just as we don't mourn our childhood when we become adults, we need not mourn when the soul transitions to a new body.",
            "strengthReflection": "I see change and transition as natural, not as loss. Growth requires letting go of previous forms.",
            "devotionalSurrender": "Lord, help me embrace all transitions in life with the serenity of one who knows the soul is eternal.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-14",
            "chapter": 2,
            "verse": 14,
            "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
            "transliteration": "mātrā-sparśhās tu kaunteya śhītoṣhṇa-sukha-duḥkha-dāḥ āgamāpāyino 'nityās tāns titikṣhasva bhārata",
            "simpleMeaning": "The contact of senses with their objects gives rise to feelings of cold and heat, pleasure and pain. They are temporary, appearing and disappearing. Bear them patiently, O Arjuna.",
            "practicalExplanation": "Life constantly swings between pleasure and pain, comfort and discomfort. These experiences are temporary — they come and go like seasons. Develop mental resilience. Equanimity is your armor.",
            "strengthReflection": "I acknowledge that both joy and sorrow are temporary visitors. I choose to remain steady.",
            "devotionalSurrender": "Lord Krishna, grant me the strength to endure all dualities of life with patience.",
            "emotions": [
                "fear",
                "failure",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-15",
            "chapter": 2,
            "verse": 15,
            "sanskrit": "यं हि न व्यथयन्त्येते पुरुषं पुरुषर्षभ। समदुःखसुखं धीरं सोऽमृतत्वाय कल्पते॥",
            "transliteration": "yaṁ hi na vyathayanty ete puruṣhaṁ puruṣharṣhabha sama-duḥkha-sukhaṁ dhīraṁ so 'mṛitatvāya kalpate",
            "simpleMeaning": "O best of men, that wise person who remains balanced in pleasure and pain, whom these do not disturb, is fit for immortality.",
            "practicalExplanation": "Equanimity under all circumstances qualifies one for liberation. Not being shaken by external events is the mark of true wisdom. This stability comes from knowing our eternal nature.",
            "strengthReflection": "I cultivate steadiness in both pleasure and pain, knowing this balance leads to true freedom.",
            "devotionalSurrender": "O Purusharshabha, make me steady in joy and sorrow. Prepare me for immortality.",
            "emotions": [
                "fear",
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-16",
            "chapter": 2,
            "verse": 16,
            "sanskrit": "नासतो विद्यते भावो नाभावो विद्यते सतः। उभयोरपि दृष्टोऽन्तस्त्वनयोस्तत्त्वदर्शिभिः॥",
            "transliteration": "nāsato vidyate bhāvo nābhāvo vidyate sataḥ ubhayor api dṛiṣhṭo 'ntas tv anayos tattva-darśhibhiḥ",
            "simpleMeaning": "The unreal has no existence, and the real never ceases to exist. The seers of truth have concluded the nature of both.",
            "practicalExplanation": "What is temporary was never truly real; what is eternal cannot be destroyed. The body is temporary, the soul is eternal. Focus on what is permanent, not on what passes away.",
            "strengthReflection": "I distinguish between what is temporary and what is eternal, investing in what truly lasts.",
            "devotionalSurrender": "Lord, help me see past illusions to the eternal truth that never changes.",
            "emotions": [
                "fear",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-17",
            "chapter": 2,
            "verse": 17,
            "sanskrit": "अविनाशि तु तद्विद्धि येन सर्वमिदं ततम्। विनाशमव्ययस्यास्य न कश्चित्कर्तुमर्हति॥",
            "transliteration": "avināśhi tu tad viddhi yena sarvam idaṁ tatam vināśham avyayasyāsya na kaśhchit kartum arhati",
            "simpleMeaning": "Know that which pervades the entire body is indestructible. No one can destroy the imperishable soul.",
            "practicalExplanation": "The soul pervades the body but is not limited to it. It cannot be destroyed by any force. Understanding this removes fear - what can anyone do to the eternal soul?",
            "strengthReflection": "My true self cannot be harmed. With this knowledge, I face all challenges without fear.",
            "devotionalSurrender": "O Indestructible One, let me know my own indestructible nature and be free from fear.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-18",
            "chapter": 2,
            "verse": 18,
            "sanskrit": "अन्तवन्त इमे देहा नित्यस्योक्ताः शरीरिणः। अनाशिनोऽप्रमेयस्य तस्माद्युध्यस्व भारत॥",
            "transliteration": "antavanta ime dehā nityasyoktāḥ śharīriṇaḥ anāśhino 'prameyasya tasmād yudhyasva bhārata",
            "simpleMeaning": "Only the material body of the eternal, indestructible, and immeasurable soul is subject to destruction. Therefore, fight, O Arjuna!",
            "practicalExplanation": "Only the body dies, not the soul. With this understanding, fight! This is Krishna's first clear instruction - armed with knowledge of the eternal soul, there is no reason to avoid duty.",
            "strengthReflection": "Understanding my eternal nature, I engage fully with my duties without hesitation.",
            "devotionalSurrender": "Lord, with knowledge of my immortal soul, I rise to fulfill my dharma without fear.",
            "emotions": [
                "fear",
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-19",
            "chapter": 2,
            "verse": 19,
            "sanskrit": "य एनं वेत्ति हन्तारं यश्चैनं मन्यते हतम्। उभौ तौ न विजानीतो नायं हन्ति न हन्यते॥",
            "transliteration": "ya enaṁ vetti hantāraṁ yaśh chainaṁ manyate hatam ubhau tau na vijānīto nāyaṁ hanti na hanyate",
            "simpleMeaning": "Those who think the soul kills or is killed do not understand. The soul neither kills nor is killed.",
            "practicalExplanation": "The soul transcends action and its results. It is the witness, not the doer. Understanding this frees us from the guilt of necessary action and the fear of harm.",
            "strengthReflection": "I am not the doer of actions. As the eternal witness, I remain untouched by outcomes.",
            "devotionalSurrender": "O Krishna, reveal to me my true nature beyond action and reaction.",
            "emotions": [
                "fear",
                "duty",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-20",
            "chapter": 2,
            "verse": 20,
            "sanskrit": "न जायते म्रियते वा कदाचिन्नायं भूत्वा भविता वा न भूयः। अजो नित्यः शाश्वतोऽयं पुराणो न हन्यते हन्यमाने शरीरे॥",
            "transliteration": "na jāyate mriyate vā kadāchin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ ajo nityaḥ śhāśhvato 'yaṁ purāṇo na hanyate hanyamāne śharīre",
            "simpleMeaning": "The soul is never born and never dies; it has never come into being and will never cease to be. It is unborn, eternal, ever-existing, and primeval. It is not slain when the body is slain.",
            "practicalExplanation": "This is the central teaching about the soul - it was never born and will never die. It exists eternally. The body's death doesn't touch it. With this knowledge, what is there to fear?",
            "strengthReflection": "I am birthless and deathless. I am the eternal soul witnessing this temporary drama of life.",
            "devotionalSurrender": "O Eternal Lord, awaken in me the knowledge of my own eternal, unborn nature.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-21",
            "chapter": 2,
            "verse": 21,
            "sanskrit": "वेदाविनाशिनं नित्यं य एनमजमव्ययम्। कथं स पुरुषः पार्थ कं घातयति हन्ति कम्॥",
            "transliteration": "vedāvināśhinaṁ nityaṁ ya enam ajam avyayam kathaṁ sa puruṣhaḥ pārtha kaṁ ghātayati hanti kam",
            "simpleMeaning": "O Partha, how can one who knows the soul to be indestructible, eternal, unborn, and immutable, kill anyone or cause anyone to be killed?",
            "practicalExplanation": "When you truly understand the soul's eternal nature, you realize that no one truly kills or dies. Bodies change, souls continue. This understanding transforms how we see all action.",
            "strengthReflection": "With knowledge of eternal nature, I act without fear of causing ultimate harm to souls.",
            "devotionalSurrender": "Lord, free me from misunderstanding about death and grant me vision of eternal truths.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-22",
            "chapter": 2,
            "verse": 22,
            "sanskrit": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
            "transliteration": "vāsānsi jīrṇāni yathā vihāya navāni gṛihṇāti naro 'parāṇi tathā śharīrāṇi vihāya jīrṇāny anyāni saṁyāti navāni dehī",
            "simpleMeaning": "Just as a person discards worn-out clothes and puts on new ones, so the soul discards worn-out bodies and enters new ones.",
            "practicalExplanation": "Death is like changing clothes. The soul simply moves from an old body to a new one. This beautiful metaphor makes death less fearsome - it's a transition, not an ending.",
            "strengthReflection": "Death is merely a change of garments for the eternal soul. I release fear of this natural transition.",
            "devotionalSurrender": "O Krishna, when this body is worn out, grant me a new form suitable for continued service to You.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-23",
            "chapter": 2,
            "verse": 23,
            "sanskrit": "नैनं छिन्दन्ति शस्त्राणि नैनं दहति पावकः। न चैनं क्लेदयन्त्यापो न शोषयति मारुतः॥",
            "transliteration": "nainaṁ chhindanti śhastrāṇi nainaṁ dahati pāvakaḥ na chainaṁ kledayanty āpo na śhoṣhayati mārutaḥ",
            "simpleMeaning": "Weapons cannot cut the soul, fire cannot burn it, water cannot wet it, and wind cannot dry it.",
            "practicalExplanation": "The soul is beyond all physical elements. No material force can affect it. What we truly are is invincible. This knowledge is the foundation of fearlessness.",
            "strengthReflection": "Nothing in this physical world can harm my true self. I am invincible at my core.",
            "devotionalSurrender": "Lord, help me realize my invulnerable nature and face all challenges with courage.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-24",
            "chapter": 2,
            "verse": 24,
            "sanskrit": "अच्छेद्योऽयमदाह्योऽयमक्लेद्योऽशोष्य एव च। नित्यः सर्वगतः स्थाणुरचलोऽयं सनातनः॥",
            "transliteration": "achchhedyo 'yam adāhyo 'yam akledyo 'śhoṣhya eva cha nityaḥ sarva-gataḥ sthāṇur achalo 'yaṁ sanātanaḥ",
            "simpleMeaning": "The soul cannot be cut, burned, wetted, or dried. It is eternal, all-pervading, stable, immovable, and everlasting.",
            "practicalExplanation": "These descriptions of the soul build an image of absolute security. When you know yourself as this indestructible essence, fear becomes impossible.",
            "strengthReflection": "I am eternal, all-pervading, unchanging. From this stable center, I face all of life.",
            "devotionalSurrender": "O Eternal One, establish me in the knowledge of my own unchanging nature.",
            "emotions": [
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-25",
            "chapter": 2,
            "verse": 25,
            "sanskrit": "अव्यक्तोऽयमचिन्त्योऽयमविकार्योऽयमुच्यते। तस्मादेवं विदित्वैनं नानुशोचितुमर्हसि॥",
            "transliteration": "avyakto 'yam achintyo 'yam avikāryo 'yam uchyate tasmād evaṁ viditvainaṁ nānuśhochitum arhasi",
            "simpleMeaning": "The soul is said to be unmanifest, inconceivable, and unchangeable. Knowing this, you should not grieve.",
            "practicalExplanation": "The soul is beyond the mind's capacity to fully comprehend. It is not subject to change. With this understanding, grief for physical death makes no sense.",
            "strengthReflection": "I release grief over physical changes, knowing the soul remains forever unchanged.",
            "devotionalSurrender": "Lord, take me beyond the mind's limitations to know my unchangeable essence.",
            "emotions": [
                "attachment",
                "fear",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-26",
            "chapter": 2,
            "verse": 26,
            "sanskrit": "अथ चैनं नित्यजातं नित्यं वा मन्यसे मृतम्। तथापि त्वं महाबाहो नैवं शोचितुमर्हसि॥",
            "transliteration": "atha chainaṁ nitya-jātaṁ nityaṁ vā manyase mṛitam tathāpi tvaṁ mahā-bāho naivaṁ śhochitum arhasi",
            "simpleMeaning": "Even if you think the soul is perpetually born and dies perpetually, O mighty-armed one, you should not grieve.",
            "practicalExplanation": "Krishna offers an alternative view - even if you believe in repeated births and deaths, why grieve over what is natural and inevitable? Accept the cycle of life.",
            "strengthReflection": "I accept the natural cycles of life and death without excessive grief or fear.",
            "devotionalSurrender": "O Mighty-armed Lord, help me accept all natural transitions with grace.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-27",
            "chapter": 2,
            "verse": 27,
            "sanskrit": "जातस्य हि ध्रुवो मृत्युर्ध्रुवं जन्म मृतस्य च। तस्मादपरिहार्येऽर्थे न त्वं शोचितुमर्हसि॥",
            "transliteration": "jātasya hi dhruvo mṛityur dhruvaṁ janma mṛitasya cha tasmād aparihārye 'rthe na tvaṁ śhochitum arhasi",
            "simpleMeaning": "For one who is born, death is certain; and for one who dies, birth is certain. Therefore, you should not grieve over the inevitable.",
            "practicalExplanation": "Birth and death are two sides of the same coin - inevitable, natural, and nothing to lament. Energy spent grieving over certainties is energy wasted.",
            "strengthReflection": "I accept what cannot be changed and invest my energy in what I can influence.",
            "devotionalSurrender": "Lord, grant me wisdom to accept what is inevitable and courage to engage with what I can change.",
            "emotions": [
                "fear",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-28",
            "chapter": 2,
            "verse": 28,
            "sanskrit": "अव्यक्तादीनि भूतानि व्यक्तमध्यानि भारत। अव्यक्तनिधनान्येव तत्र का परिदेवना॥",
            "transliteration": "avyaktādīni bhūtāni vyakta-madhyāni bhārata avyakta-nidhanāny eva tatra kā paridevanā",
            "simpleMeaning": "All beings are unmanifest before birth, manifest between birth and death, and unmanifest again after death. What is there to grieve about?",
            "practicalExplanation": "Before birth we existed in unmanifest form, after death we return to unmanifest form. This visible life is just a brief display. Why lament the hidden becoming hidden again?",
            "strengthReflection": "This visible life is a brief appearance of something eternal. I appreciate it without clinging.",
            "devotionalSurrender": "O Bharata, help me see this life as a precious manifestation of the eternal, to be lived fully without fear.",
            "emotions": [
                "fear",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-29",
            "chapter": 2,
            "verse": 29,
            "sanskrit": "आश्चर्यवत्पश्यति कश्चिदेनमाश्चर्यवद्वदति तथैव चान्यः। आश्चर्यवच्चैनमन्यः शृणोति श्रुत्वाप्येनं वेद न चैव कश्चित्॥",
            "transliteration": "āśhcharya-vat paśhyati kaśhchid enam āśhcharya-vad vadati tathaiva chānyaḥ āśhcharya-vach chainam anyaḥ śhṛiṇoti śhrutvāpy enaṁ veda na chaiva kaśhchit",
            "simpleMeaning": "Some look upon the soul as amazing, some speak of it as amazing, some hear of it as amazing, while others, even after hearing, cannot understand it at all.",
            "practicalExplanation": "The soul is wondrous and mysterious. Few truly understand it even when taught. This knowledge is not common - receiving it and understanding it is rare and precious.",
            "strengthReflection": "I cherish the opportunity to learn about my true nature - this wisdom is rare and precious.",
            "devotionalSurrender": "O Lord, grant me the grace to not just hear, but truly understand the wonder of the soul.",
            "emotions": [
                "self-doubt",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-30",
            "chapter": 2,
            "verse": 30,
            "sanskrit": "देही नित्यमवध्योऽयं देहे सर्वस्य भारत। तस्मात्सर्वाणि भूतानि न त्वं शोचितुमर्हसि॥",
            "transliteration": "dehī nityam avadhyo 'yaṁ dehe sarvasya bhārata tasmāt sarvāṇi bhūtāni na tvaṁ śhochitum arhasi",
            "simpleMeaning": "O Arjuna, the soul dwelling in every body can never be slain. Therefore, you should not grieve for any living being.",
            "practicalExplanation": "Krishna concludes the teaching on the soul's immortality with practical instruction - stop grieving! Knowledge must translate into action and changed perspective.",
            "strengthReflection": "Armed with knowledge of the soul's immortality, I release all grief and fear over physical endings.",
            "devotionalSurrender": "O Lord, let this knowledge transform my heart. Free me from grief over what cannot truly die.",
            "emotions": [
                "fear",
                "attachment",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-31",
            "chapter": 2,
            "verse": 31,
            "sanskrit": "स्वधर्ममपि चावेक्ष्य न विकम्पितुमर्हसि। धर्म्याद्धि युद्धाच्छ्रेयोऽन्यत्क्षत्रियस्य न विद्यते॥",
            "transliteration": "sva-dharmam api chāvekṣhya na vikampitum arhasi dharmyāddhi yuddhāch chhreyo 'nyat kṣhatriyasya na vidyate",
            "simpleMeaning": "Considering your own duty as a warrior, you should not waver. For a warrior, there is nothing better than a righteous war.",
            "practicalExplanation": "Krishna shifts from philosophy to duty. Arjuna is a warrior - fighting for righteousness is his dharma. Each person has their own dharma. Fulfilling it is the path to growth.",
            "strengthReflection": "I identify my unique duty and fulfill it without hesitation, regardless of challenges.",
            "devotionalSurrender": "Lord, help me recognize and embrace my sva-dharma with courage and dedication.",
            "emotions": [
                "duty",
                "self-doubt",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-32",
            "chapter": 2,
            "verse": 32,
            "sanskrit": "यदृच्छया चोपपन्नं स्वर्गद्वारमपावृतम्। सुखिनः क्षत्रियाः पार्थ लभन्ते युद्धमीदृशम्॥",
            "transliteration": "yadṛichchhayā chopapannaṁ svarga-dvāram apāvṛitam sukhinaḥ kṣhatriyāḥ pārtha labhante yuddham īdṛiśham",
            "simpleMeaning": "O Partha, happy are the warriors who are presented with such an opportunity for righteous war, which comes unsought, opening the doors to heaven.",
            "practicalExplanation": "A righteous war for a warrior is a blessing - an opportunity to fulfill dharma. What seems like a burden may actually be a door to growth and liberation.",
            "strengthReflection": "I see challenges as opportunities for growth and fulfillment of my purpose.",
            "devotionalSurrender": "Lord, help me recognize divine opportunities even when they appear as difficult challenges.",
            "emotions": [
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "2-33",
            "chapter": 2,
            "verse": 33,
            "sanskrit": "अथ चेत्त्वमिमं धर्म्यं सङ्ग्रामं न करिष्यसि। ततः स्वधर्मं कीर्तिं च हित्वा पापमवाप्स्यसि॥",
            "transliteration": "atha chet tvam imaṁ dharmyaṁ saṅgrāmaṁ na kariṣhyasi tataḥ sva-dharmaṁ kīrtiṁ cha hitvā pāpam avāpsyasi",
            "simpleMeaning": "But if you do not fight this righteous war, you will abandon your duty and your honor, and incur sin.",
            "practicalExplanation": "Avoiding duty is not neutral - it is a sin. Running from righteous responsibility damages both character and reputation. Action has consequences, but so does inaction.",
            "strengthReflection": "I understand that avoiding my duty is not a safe option - it is a path toward degradation.",
            "devotionalSurrender": "O Krishna, save me from the sin of avoidance. Give me courage to face what I must face.",
            "emotions": [
                "duty",
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-34",
            "chapter": 2,
            "verse": 34,
            "sanskrit": "अकीर्तिं चापि भूतानि कथयिष्यन्ति तेऽव्ययाम्। सम्भावितस्य चाकीर्तिर्मरणादतिरिच्यते॥",
            "transliteration": "akīrtiṁ chāpi bhūtāni kathayiṣhyanti te 'vyayām sambhāvitasya chākīrtir maraṇād atirichyate",
            "simpleMeaning": "People will speak of your everlasting dishonor. For a respectable person, dishonor is worse than death.",
            "practicalExplanation": "Reputation matters, especially for those who have established themselves. Living in dishonor is a kind of death worse than physical death. Preserve your integrity.",
            "strengthReflection": "I protect my integrity and reputation through right action, not through avoidance of challenge.",
            "devotionalSurrender": "Lord, let me always act in ways that honor You and Your teachings.",
            "emotions": [
                "fear",
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-35",
            "chapter": 2,
            "verse": 35,
            "sanskrit": "भयाद्रणादुपरतं मंस्यन्ते त्वां महारथाः। येषां च त्वं बहुमतो भूत्वा यास्यसि लाघवम्॥",
            "transliteration": "bhayād raṇād uparataṁ maṁsyante tvāṁ mahā-rathāḥ yeṣhāṁ cha tvaṁ bahu-mato bhūtvā yāsyasi lāghavam",
            "simpleMeaning": "The great warriors will think you fled from battle out of fear, and those who held you in high esteem will think lightly of you.",
            "practicalExplanation": "Withdrawal will be interpreted as cowardice. Those who respected you will lose respect. Flight from duty, whatever the inner rationalization, looks like fear to the world.",
            "strengthReflection": "I stand firm in my duty, not allowing fear to dictate my actions.",
            "devotionalSurrender": "O Lord, remove all cowardice from my heart. Let me act with courage that honors Your presence within.",
            "emotions": [
                "fear",
                "self-doubt",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-36",
            "chapter": 2,
            "verse": 36,
            "sanskrit": "अवाच्यवादांश्च बहून्वदिष्यन्ति तवाहिताः। निन्दन्तस्तव सामर्थ्यं ततो दुःखतरं नु किम्॥",
            "transliteration": "avāchya-vādānśh cha bahūn vadiṣhyanti tavāhitāḥ nindantas tava sāmarthyaṁ tato duḥkhataraṁ nu kim",
            "simpleMeaning": "Your enemies will speak many unspeakable words, slandering your abilities. What could be more painful than that?",
            "practicalExplanation": "Enemies will mock you, question your capability. Better to fight and fall than to give your opponents reason to ridicule your abilities. Face challenges head-on.",
            "strengthReflection": "I would rather face challenge and fail than give up and face mockery.",
            "devotionalSurrender": "Lord, let me face my critics through action, not retreat into comfortable excuses.",
            "emotions": [
                "fear",
                "self-doubt",
                "anger"
            ],
            "audioUrl": null
        },
        {
            "id": "2-37",
            "chapter": 2,
            "verse": 37,
            "sanskrit": "हतो वा प्राप्स्यसि स्वर्गं जित्वा वा भोक्ष्यसे महीम्। तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चयः॥",
            "transliteration": "hato vā prāpsyasi svargaṁ jitvā vā bhokṣhyase mahīm tasmād uttiṣhṭha kaunteya yuddhāya kṛita-niśhchayaḥ",
            "simpleMeaning": "If you are killed, you will attain heaven; if you are victorious, you will enjoy the earth. Therefore, arise, O son of Kunti, and be determined to fight.",
            "practicalExplanation": "Win or lose, the warrior who fights gains either earthly victory or heavenly reward. There is no losing when you fulfill your dharma. Rise and fight!",
            "strengthReflection": "In fulfilling my duty, I cannot lose. Victory brings rewards; sincere effort brings growth.",
            "devotionalSurrender": "O Kaunteya, I arise to fight my battles, trusting that You ensure no true loss for those who do their duty.",
            "emotions": [
                "duty",
                "fear",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-38",
            "chapter": 2,
            "verse": 38,
            "sanskrit": "सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ। ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि॥",
            "transliteration": "sukha-duḥkhe same kṛitvā lābhālābhau jayājayau tato yuddhāya yujyasva naivaṁ pāpam avāpsyasi",
            "simpleMeaning": "Treating pleasure and pain, gain and loss, victory and defeat alike, engage in battle. Thus you will not incur sin.",
            "practicalExplanation": "Equanimity is the key - be equal in pleasure and pain, gain and loss, victory and defeat. With this mindset, action becomes free from karmic bondage. This is the secret of karma yoga.",
            "strengthReflection": "I engage in action with equanimity, not attached to outcomes, free from the bondage of results.",
            "devotionalSurrender": "Lord, grant me equal vision in success and failure. Let me act as Your instrument, free from attachment.",
            "emotions": [
                "attachment",
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-39",
            "chapter": 2,
            "verse": 39,
            "sanskrit": "एषा तेऽभिहिता साङ्ख्ये बुद्धिर्योगे त्विमां शृणु। बुद्ध्या युक्तो यया पार्थ कर्मबन्धं प्रहास्यसि॥",
            "transliteration": "eṣhā te 'bhihitā sānkhye buddhir yoge tvimāṁ śhṛiṇu buddhyā yukto yayā pārtha karma-bandhaṁ prahāsyasi",
            "simpleMeaning": "I have explained to you the analytical knowledge of Sankhya. Now listen to the wisdom of Yoga, by which you can free yourself from the bondage of action.",
            "practicalExplanation": "Krishna transitions from philosophy (Sankhya) to practical yoga. Knowledge alone is not enough - we need practical methods to apply it. Action with wisdom is yoga.",
            "strengthReflection": "I seek both wisdom and practical methods, uniting knowledge with action.",
            "devotionalSurrender": "O Teacher, continue to instruct me. Show me how to act without creating bondage.",
            "emotions": [
                "duty",
                "discipline",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-40",
            "chapter": 2,
            "verse": 40,
            "sanskrit": "नेहाभिक्रमनाशोऽस्ति प्रत्यवायो न विद्यते। स्वल्पमप्यस्य धर्मस्य त्रायते महतो भयात्॥",
            "transliteration": "nehābhikrama-nāśho 'sti pratyavāyo na vidyate svalpam apy asya dharmasya trāyate mahato bhayāt",
            "simpleMeaning": "In this path, no effort is ever lost, and there is no adverse effect. Even a little practice of this dharma protects one from great fear.",
            "practicalExplanation": "Every step on this path counts - nothing is wasted. Unlike material efforts that can fail completely, spiritual progress is never lost. Even small efforts bring great protection.",
            "strengthReflection": "Every small step I take toward my goals matters. Nothing I do with sincere effort is ever wasted.",
            "devotionalSurrender": "Lord, I trust that even my smallest efforts toward You are preserved and significant.",
            "emotions": [
                "fear",
                "self-doubt",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-41",
            "chapter": 2,
            "verse": 41,
            "sanskrit": "व्यवसायात्मिका बुद्धिरेकेह कुरुनन्दन। बहुशाखा ह्यनन्ताश्च बुद्धयोऽव्यवसायिनाम्॥",
            "transliteration": "vyavasāyātmikā buddhir ekeha kuru-nandana bahu-śhākhā hy anantāśh cha buddhayo 'vyavasāyinām",
            "simpleMeaning": "Those who are resolute have single-pointed determination. But the intellect of the irresolute is many-branched and endless.",
            "practicalExplanation": "Focus is everything. The determined mind has one goal; the scattered mind has endless goals. Indecision dissipates energy. Choose a path and commit fully.",
            "strengthReflection": "I commit fully to my chosen path, avoiding the paralysis of endless options.",
            "devotionalSurrender": "O Krishna, give me single-pointed devotion to You, free from the confusion of many branches.",
            "emotions": [
                "overthinking",
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-42",
            "chapter": 2,
            "verse": 42,
            "sanskrit": "यामिमां पुष्पितां वाचं प्रवदन्त्यविपश्चितः। वेदवादरताः पार्थ नान्यदस्तीति वादिनः॥",
            "transliteration": "yām imāṁ puṣhpitāṁ vāchaṁ pravadanty avipaśhchitaḥ veda-vāda-ratāḥ pārtha nānyad astīti vādinaḥ",
            "simpleMeaning": "The unwise, attached to flowery words of the Vedas, declare that there is nothing else, O Partha.",
            "practicalExplanation": "Krishna warns against those who miss the deeper meaning of scriptures, attached only to rituals and rewards. Wisdom lies in the spirit, not just the letter of sacred texts.",
            "strengthReflection": "I seek the deeper truth behind teachings, not just their surface promises.",
            "devotionalSurrender": "Lord, help me pierce through religious externals to the eternal truth they point to.",
            "emotions": [
                "overthinking",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-43",
            "chapter": 2,
            "verse": 43,
            "sanskrit": "कामात्मानः स्वर्गपरा जन्मकर्मफलप्रदाम्। क्रियाविशेषबहुलां भोगैश्वर्यगतिं प्रति॥",
            "transliteration": "kāmātmānaḥ svarga-parā janma-karma-phala-pradām kriyā-viśheṣha-bahulāṁ bhogaiśhwarya-gatiṁ prati",
            "simpleMeaning": "Full of desires and aiming at heaven, they prescribe numerous rituals for obtaining enjoyment and opulence, leading to rebirth as the result of actions.",
            "practicalExplanation": "Desire-driven religion seeks material rewards, even heavenly ones. This keeps the soul in bondage. True spirituality aims for liberation, not just better conditions of bondage.",
            "strengthReflection": "I aim beyond temporary rewards toward true freedom and lasting fulfillment.",
            "devotionalSurrender": "Lord, free me from the trap of seeking only heavenly pleasures. I seek liberation in You.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-44",
            "chapter": 2,
            "verse": 44,
            "sanskrit": "भोगैश्वर्यप्रसक्तानां तयापहृतचेतसाम्। व्यवसायात्मिका बुद्धिः समाधौ न विधीयते॥",
            "transliteration": "bhogaiśhwarya-prasaktānāṁ tayāpahṛita-chetasām vyavasāyātmikā buddhiḥ samādhau na vidhīyate",
            "simpleMeaning": "Those deeply attached to pleasure and power, whose minds are carried away by such teachings, cannot attain the resolute determination needed for meditation.",
            "practicalExplanation": "Attachment to pleasure and power scatters the mind. With a scattered mind, deep concentration becomes impossible. Simplify desires to clarify the mind.",
            "strengthReflection": "I simplify my desires to achieve focused clarity of mind.",
            "devotionalSurrender": "O Lord, detach me from the pursuit of pleasure and power that scatters my mind.",
            "emotions": [
                "attachment",
                "discipline",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-45",
            "chapter": 2,
            "verse": 45,
            "sanskrit": "त्रैगुण्यविषया वेदा निस्त्रैगुण्यो भवार्जुन। निर्द्वन्द्वो नित्यसत्त्वस्थो निर्योगक्षेम आत्मवान्॥",
            "transliteration": "trai-guṇya-viṣhayā vedā nistrai-guṇyo bhavārjuna nirdvandvo nitya-sattva-stho niryoga-kṣhema ātmavān",
            "simpleMeaning": "The Vedas deal with the three modes of material nature. Rise above these three modes, O Arjuna. Be free from dualities, ever established in purity, free from acquisition and preservation, and situated in the self.",
            "practicalExplanation": "Transcend the material modes: inertia, passion, and even normal goodness. Be free from pairs of opposites. Need nothing, protect nothing. Just be the self.",
            "strengthReflection": "I rise above material attachments, established in my true self, needing and fearing nothing.",
            "devotionalSurrender": "O Arjuna's Lord, establish me beyond the three gunas, in eternal purity and self-knowledge.",
            "emotions": [
                "attachment",
                "discipline",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "2-46",
            "chapter": 2,
            "verse": 46,
            "sanskrit": "यावानर्थ उदपाने सर्वतः सम्प्लुतोदके। तावान्सर्वेषु वेदेषु ब्राह्मणस्य विजानतः॥",
            "transliteration": "yāvān artha udapāne sarvataḥ samplutodake tāvān sarveṣhu vedeṣhu brāhmaṇasya vijānataḥ",
            "simpleMeaning": "All purposes served by a small well can be served by a large lake. Similarly, one who knows the supreme truth fulfills the purpose of all the Vedas.",
            "practicalExplanation": "When you have the whole, you have all the parts. The enlightened soul has realized what all scriptures point to. Scriptures are maps; realization is the destination.",
            "strengthReflection": "I seek the essence that all teachings point to, not just accumulation of information.",
            "devotionalSurrender": "Lord, lead me to the ocean of truth that makes all smaller teachings obsolete.",
            "emotions": [
                "overthinking",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-47",
            "chapter": 2,
            "verse": 47,
            "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
            "transliteration": "karmaṇy evādhikāras te mā phaleṣhu kadāchana mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi",
            "simpleMeaning": "You have the right to perform your duty, but never to the fruits of your action. Never consider yourself the cause of results, nor be attached to inaction.",
            "practicalExplanation": "This is the most famous verse of the Gita. Focus on giving your best effort. Stop obsessing over outcomes. Your job is the work; results are beyond your control.",
            "strengthReflection": "Today, I will perform my duties with full commitment without being attached to the results.",
            "devotionalSurrender": "O Krishna, help me surrender the fruits of my actions to You. Let me work as Your instrument.",
            "emotions": [
                "overthinking",
                "fear",
                "attachment",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-48",
            "chapter": 2,
            "verse": 48,
            "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
            "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga uchyate",
            "simpleMeaning": "Perform your duties established in yoga, abandoning attachment. Be equal in success and failure. This equanimity is called yoga.",
            "practicalExplanation": "Yoga defined: equanimity in success and failure. Work without clinging to outcomes. This balance is the essence of spiritual practice. Act from your center, not from need.",
            "strengthReflection": "I define success by my effort and attitude, not just by external results.",
            "devotionalSurrender": "Lord, establish me in yoga - working with excellence, equal in all outcomes.",
            "emotions": [
                "attachment",
                "fear",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-49",
            "chapter": 2,
            "verse": 49,
            "sanskrit": "दूरेण ह्यवरं कर्म बुद्धियोगाद्धनञ्जय। बुद्धौ शरणमन्विच्छ कृपणाः फलहेतवः॥",
            "transliteration": "dūreṇa hy avaraṁ karma buddhi-yogād dhanañjaya buddhau śharaṇam anvichchha kṛipaṇāḥ phala-hetavaḥ",
            "simpleMeaning": "Action done with selfish motives is far inferior to action done with wisdom. Take refuge in this wisdom. Those motivated by results are miserable.",
            "practicalExplanation": "Selfish action leads to bondage; wise action leads to freedom. Those obsessed with results live in constant anxiety. Find refuge in wisdom, acting from understanding.",
            "strengthReflection": "I take refuge in wisdom, letting go of anxious attachment to specific outcomes.",
            "devotionalSurrender": "O Dhananjaya's Lord, let me take shelter in wisdom, free from the misery of result-obsession.",
            "emotions": [
                "attachment",
                "fear",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-50",
            "chapter": 2,
            "verse": 50,
            "sanskrit": "बुद्धियुक्तो जहातीह उभे सुकृतदुष्कृते। तस्माद्योगाय युज्यस्व योगः कर्मसु कौशलम्॥",
            "transliteration": "buddhi-yukto jahātīha ubhe sukṛita-duṣhkṛite tasmād yogāya yujyasva yogaḥ karmasu kauśhalam",
            "simpleMeaning": "One united with wisdom transcends both good and bad actions in this life. Therefore, strive for yoga. Yoga is skill in action.",
            "practicalExplanation": "The enlightened transcend even good karma - both bind. Yoga is skill in action: doing what needs to be done without creating bondage. This is the art of living.",
            "strengthReflection": "I develop skill in action - doing what's needed without creating emotional or karmic entanglement.",
            "devotionalSurrender": "Lord, teach me the skill of action that frees rather than binds.",
            "emotions": [
                "duty",
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-51",
            "chapter": 2,
            "verse": 51,
            "sanskrit": "कर्मजं बुद्धियुक्ता हि फलं त्यक्त्वा मनीषिणः। जन्मबन्धविनिर्मुक्ताः पदं गच्छन्त्यनामयम्॥",
            "transliteration": "karma-jaṁ buddhi-yuktā hi phalaṁ tyaktvā manīṣhiṇaḥ janma-bandha-vinirmuktāḥ padaṁ gachchhanty anāmayam",
            "simpleMeaning": "The wise, united with wisdom and renouncing the fruits of action, are freed from the bondage of birth and attain the state beyond all sorrow.",
            "practicalExplanation": "Renouncing attachment to results leads to liberation from the cycle of rebirth. This is not fatalism but active engagement without anxious clinging. True freedom is here.",
            "strengthReflection": "I work with full engagement while releasing attachment, moving toward true freedom.",
            "devotionalSurrender": "O Lord, free me from the cycle of birth and death. Lead me to the state beyond sorrow.",
            "emotions": [
                "attachment",
                "fear",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-52",
            "chapter": 2,
            "verse": 52,
            "sanskrit": "यदा ते मोहकलिलं बुद्धिर्व्यतितरिष्यति। तदा गन्तासि निर्वेदं श्रोतव्यस्य श्रुतस्य च॥",
            "transliteration": "yadā te moha-kalilaṁ buddhir vyatitariṣhyati tadā gantāsi nirvedaṁ śhrotavyasya śhrutasya cha",
            "simpleMeaning": "When your intellect crosses beyond the dense forest of delusion, you will become indifferent to all that has been heard and all that is yet to be heard.",
            "practicalExplanation": "Beyond delusion, you transcend even scriptures. The map is no longer needed when you've arrived. The enlightened no longer need external guidance - they are the truth.",
            "strengthReflection": "I use teachings as tools for awakening, not as ends in themselves.",
            "devotionalSurrender": "Lord, lead me beyond all delusions to direct realization of truth.",
            "emotions": [
                "overthinking",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-53",
            "chapter": 2,
            "verse": 53,
            "sanskrit": "श्रुतिविप्रतिपन्ना ते यदा स्थास्यति निश्चला। समाधावचला बुद्धिस्तदा योगमवाप्स्यसि॥",
            "transliteration": "śhruti-vipratipannā te yadā sthāsyati niśhchalā samādhāv achalā buddhis tadā yogam avāpsyasi",
            "simpleMeaning": "When your intellect, no longer confused by the variety of scriptural teachings, stands firm and steady in meditation, then you will attain yoga.",
            "practicalExplanation": "When the mind is no longer pulled in different directions by various teachings, when it becomes steady and focused in meditation - that is yoga. Clarity and stillness are the goal.",
            "strengthReflection": "I move toward mental clarity where my mind is no longer pulled by conflicting ideas.",
            "devotionalSurrender": "O Krishna, stabilize my intellect in steady contemplation of You.",
            "emotions": [
                "overthinking",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-54",
            "chapter": 2,
            "verse": 54,
            "sanskrit": "अर्जुन उवाच। स्थितप्रज्ञस्य का भाषा समाधिस्थस्य केशव। स्थितधीः किं प्रभाषेत किमासीत व्रजेत किम्॥",
            "transliteration": "arjuna uvācha sthita-prajñasya kā bhāṣhā samādhi-sthasya keśhava sthita-dhīḥ kiṁ prabhāṣheta kim āsīta vrajeta kim",
            "simpleMeaning": "Arjuna said: O Keshava, what are the signs of one whose wisdom is steady, who is established in meditation? How does one of steady wisdom speak, sit, and walk?",
            "practicalExplanation": "Arjuna asks a brilliant practical question - how can we recognize enlightenment in daily life? What are the visible signs? This begins Krishna's beautiful description of the stable sage.",
            "strengthReflection": "I seek not just theory but practical markers of growth and wisdom in daily life.",
            "devotionalSurrender": "O Keshava, show me the signs of true wisdom so I may recognize and cultivate them.",
            "emotions": [
                "overthinking",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-55",
            "chapter": 2,
            "verse": 55,
            "sanskrit": "श्रीभगवानुवाच। प्रजहाति यदा कामान्सर्वान्पार्थ मनोगतान्। आत्मन्येवात्मना तुष्टः स्थितप्रज्ञस्तदोच्यते॥",
            "transliteration": "śhrī bhagavān uvācha prajahāti yadā kāmān sarvān pārtha mano-gatān ātmany evātmanā tuṣhṭaḥ sthita-prajñas tadochyate",
            "simpleMeaning": "The Supreme Lord said: O Partha, when one completely gives up all desires of the mind and is satisfied in the self by the self, one is said to be of steady wisdom.",
            "practicalExplanation": "The sage has dropped all mental desires - not through suppression but through finding complete fulfillment within. Self-sufficient in the self - this is the mark of wisdom.",
            "strengthReflection": "I seek fulfillment from within rather than from endless external desires.",
            "devotionalSurrender": "Lord, fill me with such inner satisfaction that external desires naturally fall away.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-56",
            "chapter": 2,
            "verse": 56,
            "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
            "transliteration": "duḥkheṣhv anudvigna-manāḥ sukheṣhu vigata-spṛihaḥ vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir uchyate",
            "simpleMeaning": "One whose mind is not disturbed by sorrow, who does not crave pleasure, and who is free from attachment, fear, and anger - such a sage is called one of steady wisdom.",
            "practicalExplanation": "The sage is not shaken by sorrow or excited by pleasure. Free from attachment, fear, and anger - the three great disturbers of peace. This is emotional mastery.",
            "strengthReflection": "I work to remain unshaken by sorrow, unexcited by pleasure, free from fear and anger.",
            "devotionalSurrender": "O Lord, free me from the grip of attachment, fear, and anger. Grant me steady wisdom.",
            "emotions": [
                "fear",
                "anger",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-57",
            "chapter": 2,
            "verse": 57,
            "sanskrit": "यः सर्वत्रानभिस्नेहस्तत्तत्प्राप्य शुभाशुभम्। नाभिनन्दति न द्वेष्टि तस्य प्रज्ञा प्रतिष्ठिता॥",
            "transliteration": "yaḥ sarvatrānabhisnehas tat tat prāpya śhubhāśhubham nābhinandati na dveṣhṭi tasya prajñā pratiṣhṭhitā",
            "simpleMeaning": "One who is without attachment everywhere, who neither rejoices nor hates on obtaining good or evil, is firmly established in wisdom.",
            "practicalExplanation": "Equal response to good and evil fortune - no excessive joy or hatred. This is not indifference but a deeper stability that sees beyond surface events.",
            "strengthReflection": "I receive both favorable and unfavorable experiences with equanimity.",
            "devotionalSurrender": "Lord, establish me in wisdom that sees beyond surface good and evil.",
            "emotions": [
                "attachment",
                "anger",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-58",
            "chapter": 2,
            "verse": 58,
            "sanskrit": "यदा संहरते चायं कूर्मोऽङ्गानीव सर्वशः। इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता॥",
            "transliteration": "yadā saṁharate chāyaṁ kūrmo 'ṅgānīva sarvaśhaḥ indriyāṇīndriyārthebhyas tasya prajñā pratiṣhṭhitā",
            "simpleMeaning": "When one withdraws the senses from sense objects like a tortoise withdrawing its limbs, one's wisdom is firmly established.",
            "practicalExplanation": "The tortoise withdraws its limbs when threatened. Similarly, the sage can withdraw attention from the senses at will. This is mastery over the senses, not denial of them.",
            "strengthReflection": "I develop the ability to withdraw my attention from external distractions at will.",
            "devotionalSurrender": "O Lord, grant me the ability to turn my senses inward toward You.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-59",
            "chapter": 2,
            "verse": 59,
            "sanskrit": "विषया विनिवर्तन्ते निराहारस्य देहिनः। रसवर्जं रसोऽप्यस्य परं दृष्ट्वा निवर्तते॥",
            "transliteration": "viṣhayā vinivartante nirāhārasya dehinaḥ rasa-varjaṁ raso 'py asya paraṁ dṛiṣhṭvā nivartate",
            "simpleMeaning": "Sense objects turn away from the abstinent, though the taste for them remains. But even this taste ceases for one who has seen the Supreme.",
            "practicalExplanation": "Merely avoiding sense objects doesn't remove the craving. True freedom comes only when one tastes something higher. When you've found the infinite, finite pleasures naturally lose their grip.",
            "strengthReflection": "I seek higher experiences that naturally make lower cravings fade away.",
            "devotionalSurrender": "Lord, grant me a taste of Your divine bliss that makes all lesser pleasures pale.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-60",
            "chapter": 2,
            "verse": 60,
            "sanskrit": "यततो ह्यपि कौन्तेय पुरुषस्य विपश्चितः। इन्द्रियाणि प्रमाथीनि हरन्ति प्रसभं मनः॥",
            "transliteration": "yatato hy api kaunteya puruṣhasya vipaśhchitaḥ indriyāṇi pramāthīni haranti prasabhaṁ manaḥ",
            "simpleMeaning": "O son of Kunti, the turbulent senses can forcibly carry away the mind of even a discerning person who is striving for self-control.",
            "practicalExplanation": "Even the wisest and most disciplined can be overpowered by the senses. This is a warning against complacency. Vigilance must be constant.",
            "strengthReflection": "I remain vigilant knowing that even the wise can be overpowered by senses.",
            "devotionalSurrender": "O Kaunteya's Lord, protect me from the powerful force of the senses.",
            "emotions": [
                "attachment",
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-61",
            "chapter": 2,
            "verse": 61,
            "sanskrit": "तानि सर्वाणि संयम्य युक्त आसीत मत्परः। वशे हि यस्येन्द्रियाणि तस्य प्रज्ञा प्रतिष्ठिता॥",
            "transliteration": "tāni sarvāṇi saṁyamya yukta āsīta mat-paraḥ vaśhe hi yasyendriyāṇi tasya prajñā pratiṣhṭhitā",
            "simpleMeaning": "Having controlled all the senses, one should sit in meditation with Me as the supreme goal. One who has mastered the senses is established in wisdom.",
            "practicalExplanation": "The solution: control senses, focus on the Divine. Making God the supreme goal naturally brings sense control. It's not about suppression but redirection toward the highest.",
            "strengthReflection": "I redirect my senses toward higher goals rather than simply suppressing them.",
            "devotionalSurrender": "O Lord, You are my supreme goal. With my senses fixed on You, I find stability.",
            "emotions": [
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-62",
            "chapter": 2,
            "verse": 62,
            "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
            "transliteration": "dhyāyato viṣhayān puṁsaḥ saṅgas teṣhūpajāyate saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate",
            "simpleMeaning": "When a person dwells on sense objects, attachment develops. From attachment arises desire, and from unfulfilled desire comes anger.",
            "practicalExplanation": "Here is the chain reaction: thinking leads to attachment, attachment to desire, unfulfilled desire to anger. Guard your thoughts - they are the first link in the chain of bondage.",
            "strengthReflection": "I guard the gates of my mind, knowing that my attention shapes my reality.",
            "devotionalSurrender": "O Lord, anchor my mind in thoughts of You. Break the chain of bondage.",
            "emotions": [
                "attachment",
                "anger",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-63",
            "chapter": 2,
            "verse": 63,
            "sanskrit": "क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः। स्मृतिभ्रंशाद् बुद्धिनाशो बुद्धिनाशात्प्रणश्यति॥",
            "transliteration": "krodhād bhavati sammohaḥ sammohāt smṛiti-vibhramaḥ smṛiti-bhraṁśhād buddhi-nāśho buddhi-nāśhāt praṇaśhyati",
            "simpleMeaning": "From anger arises delusion; from delusion, confusion of memory; from confusion of memory, destruction of intelligence; and from destruction of intelligence, one perishes.",
            "practicalExplanation": "The chain continues: anger causes delusion, delusion causes memory loss, memory loss destroys intelligence, and without intelligence comes complete destruction. This is the downward spiral.",
            "strengthReflection": "I recognize and interrupt the downward spiral before anger leads to self-destruction.",
            "devotionalSurrender": "Lord, protect me from the destructive spiral of anger and delusion.",
            "emotions": [
                "anger",
                "overthinking",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-64",
            "chapter": 2,
            "verse": 64,
            "sanskrit": "रागद्वेषवियुक्तैस्तु विषयानिन्द्रियैश्चरन्। आत्मवश्यैर्विधेयात्मा प्रसादमधिगच्छति॥",
            "transliteration": "rāga-dveṣha-viyuktais tu viṣhayān indriyaiśh charan ātma-vaśhyair vidheyātmā prasādam adhigachchhati",
            "simpleMeaning": "But one who controls the mind and moves among sense objects with senses freed from attachment and aversion attains divine grace and inner peace.",
            "practicalExplanation": "The disciplined person can engage with the world without being trapped by attraction or aversion. This is not withdrawal but mastery - participating in life without bondage.",
            "strengthReflection": "I engage with the world freely, without being controlled by attraction or repulsion.",
            "devotionalSurrender": "Lord, free me from likes and dislikes. Let me move through the world with inner peace.",
            "emotions": [
                "attachment",
                "anger",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-65",
            "chapter": 2,
            "verse": 65,
            "sanskrit": "प्रसादे सर्वदुःखानां हानिरस्योपजायते। प्रसन्नचेतसो ह्याशु बुद्धिः पर्यवतिष्ठते॥",
            "transliteration": "prasāde sarva-duḥkhānāṁ hānir asyopajāyate prasanna-chetaso hy āśhu buddhiḥ paryavatiṣhṭhate",
            "simpleMeaning": "In that peace, all sorrows are destroyed, for the intellect of the tranquil-minded soon becomes firmly established.",
            "practicalExplanation": "Inner peace destroys sorrow and stabilizes intelligence. Peace is not just a pleasant feeling - it is the foundation for clarity and wisdom. Cultivate peace first.",
            "strengthReflection": "I prioritize inner peace, knowing it is the foundation for clarity and wisdom.",
            "devotionalSurrender": "O Lord, grant me Your peace, in which all sorrows dissolve.",
            "emotions": [
                "fear",
                "overthinking",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-66",
            "chapter": 2,
            "verse": 66,
            "sanskrit": "नास्ति बुद्धिरयुक्तस्य न चायुक्तस्य भावना। न चाभावयतः शान्तिरशान्तस्य कुतः सुखम्॥",
            "transliteration": "nāsti buddhir ayuktasya na chāyuktasya bhāvanā na chābhāvayataḥ śhāntir aśhāntasya kutaḥ sukham",
            "simpleMeaning": "There is no wisdom for the undisciplined, and no contemplation for the undisciplined. Without contemplation there is no peace, and without peace, how can there be happiness?",
            "practicalExplanation": "Without discipline there is no wisdom. Without wisdom no contemplation. Without contemplation no peace. Without peace no happiness. The chain is clear - discipline is the foundation.",
            "strengthReflection": "I embrace discipline as the foundation for wisdom, peace, and true happiness.",
            "devotionalSurrender": "Lord, help me build the discipline that leads to wisdom, peace, and joy.",
            "emotions": [
                "discipline",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-67",
            "chapter": 2,
            "verse": 67,
            "sanskrit": "इन्द्रियाणां हि चरतां यन्मनोऽनुविधीयते। तदस्य हरति प्रज्ञां वायुर्नावमिवाम्भसि॥",
            "transliteration": "indriyāṇāṁ hi charatāṁ yan mano 'nuvidhīyate tad asya harati prajñāṁ vāyur nāvam ivāmbhasi",
            "simpleMeaning": "When the mind runs after the wandering senses, it carries away wisdom like wind carries away a ship on water.",
            "practicalExplanation": "A mind following the senses is like a ship without anchor - blown wherever the wind takes it. Control comes from anchoring the mind, not just restraining the senses.",
            "strengthReflection": "I anchor my mind firmly so it is not carried away by sensory impulses.",
            "devotionalSurrender": "O Lord, be the anchor of my mind in the stormy sea of sense impressions.",
            "emotions": [
                "attachment",
                "discipline",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "2-68",
            "chapter": 2,
            "verse": 68,
            "sanskrit": "तस्माद्यस्य महाबाहो निगृहीतानि सर्वशः। इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता॥",
            "transliteration": "tasmād yasya mahā-bāho nigṛihītāni sarvaśhaḥ indriyāṇīndriyārthebhyas tasya prajñā pratiṣhṭhitā",
            "simpleMeaning": "Therefore, O mighty-armed one, one whose senses are completely restrained from their objects is established in wisdom.",
            "practicalExplanation": "Complete sense restraint establishes wisdom. This doesn't mean we stop experiencing - it means we stop being controlled. The senses become servants, not masters.",
            "strengthReflection": "I make my senses my servants rather than my masters.",
            "devotionalSurrender": "O Mighty-armed Lord, help me master my senses for wisdom and peace.",
            "emotions": [
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "2-69",
            "chapter": 2,
            "verse": 69,
            "sanskrit": "या निशा सर्वभूतानां तस्यां जागर्ति संयमी। यस्यां जाग्रति भूतानि सा निशा पश्यतो मुनेः॥",
            "transliteration": "yā niśhā sarva-bhūtānāṁ tasyāṁ jāgarti saṁyamī yasyāṁ jāgrati bhūtāni sā niśhā paśhyato muneḥ",
            "simpleMeaning": "What is night for all beings is the time of awakening for the self-controlled; and the time when all beings are awake is night for the seeing sage.",
            "practicalExplanation": "The sage and ordinary people live in opposite realities. What excites the worldly is meaningless to the wise; what fulfills the sage is invisible to the worldly. Choose which world you want to live in.",
            "strengthReflection": "I awaken to what truly matters rather than following the sleeping masses.",
            "devotionalSurrender": "Lord, awaken me to the reality that the world sleeps to.",
            "emotions": [
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-70",
            "chapter": 2,
            "verse": 70,
            "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
            "transliteration": "āpūryamāṇam achala-pratiṣhṭhaṁ samudram āpaḥ praviśhanti yadvat tadvat kāmā yaṁ praviśhanti sarve sa śhāntim āpnoti na kāma-kāmī",
            "simpleMeaning": "Just as waters enter the ocean, which is full and still, so too desires enter the sage who remains unmoved. Such a person attains peace, not one who craves desires.",
            "practicalExplanation": "The ocean receives all rivers but remains full and still. Similarly, the sage experiences desires without being disturbed. Desires come; the sage remains stable. This is true peace.",
            "strengthReflection": "Like the ocean, I remain full and stable even as desires flow through me.",
            "devotionalSurrender": "O Lord, make me like the ocean - full of You, unmoved by the rivers of desire.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "2-71",
            "chapter": 2,
            "verse": 71,
            "sanskrit": "विहाय कामान्यः सर्वान्पुमांश्चरति निःस्पृहः। निर्ममो निरहङ्कारः स शान्तिमधिगच्छति॥",
            "transliteration": "vihāya kāmān yaḥ sarvān pumāṁśh charati niḥspṛihaḥ nirmamo nirahankāraḥ sa śhāntim adhigachchhati",
            "simpleMeaning": "One who gives up all selfish desires, and lives free from longing, free from 'mine' and 'ego,' attains peace.",
            "practicalExplanation": "Three things to release: desires, possessiveness ('mine'), and ego ('I'). With these gone, peace is natural. These three are the root of all restlessness.",
            "strengthReflection": "I release attachment to desires, possessions, and ego-identity to find true peace.",
            "devotionalSurrender": "Lord, free me from 'I', 'me', and 'mine'. In this emptiness, fill me with Your peace.",
            "emotions": [
                "attachment",
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "2-72",
            "chapter": 2,
            "verse": 72,
            "sanskrit": "एषा ब्राह्मी स्थितिः पार्थ नैनां प्राप्य विमुह्यति। स्थित्वास्यामन्तकालेऽपि ब्रह्मनिर्वाणमृच्छति॥",
            "transliteration": "eṣhā brāhmī sthitiḥ pārtha naināṁ prāpya vimuhyati sthitvāsyām anta-kāle 'pi brahma-nirvāṇam ṛichchhati",
            "simpleMeaning": "O Partha, this is the state of realizing Brahman. Having attained this, one is never again confused. Being established in this state even at the moment of death, one attains liberation in Brahman.",
            "practicalExplanation": "This divine state, once attained, is never lost. Even if achieved only at death, it leads to liberation. But why wait? Begin now and live in freedom. This is the Brahmic state - the goal of life.",
            "strengthReflection": "I work toward the ultimate state of consciousness where confusion and suffering end forever.",
            "devotionalSurrender": "O Partha's Lord, establish me in the Brahmic state, now and at the hour of death.",
            "emotions": [
                "fear",
                "discipline",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "3-1",
            "chapter": 3,
            "verse": 1,
            "sanskrit": "अर्जुन उवाच। ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन। तत्किं कर्मणि घोरे मां नियोजयसि केशव॥",
            "transliteration": "arjuna uvācha jyāyasī chet karmaṇas te matā buddhir janārdana tat kiṁ karmaṇi ghore māṁ niyojayasi keśhava",
            "simpleMeaning": "Arjuna said: O Janardana, if You consider knowledge superior to action, why then do You ask me to engage in this terrible war, O Keshava?",
            "practicalExplanation": "Arjuna is confused - if wisdom is higher than action, why fight? This is a common misunderstanding. True wisdom expresses through right action, not inaction.",
            "strengthReflection": "I understand that true wisdom is demonstrated through right action, not through avoidance.",
            "devotionalSurrender": "O Keshava, clarify my confusion between knowledge and action.",
            "emotions": [
                "overthinking",
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "3-2",
            "chapter": 3,
            "verse": 2,
            "sanskrit": "व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे। तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम्॥",
            "transliteration": "vyāmiśhreṇeva vākyena buddhiṁ mohayasīva me tad ekaṁ vada niśhchitya yena śhreyo 'ham āpnuyām",
            "simpleMeaning": "My intellect is confused by Your ambiguous words. Tell me decisively that one path by which I can attain the highest good.",
            "practicalExplanation": "Arjuna wants one clear path. But life isn't that simple - different situations require different approaches. The wise integrate multiple truths rather than seeking oversimplification.",
            "strengthReflection": "I embrace complexity rather than demanding oversimplified answers.",
            "devotionalSurrender": "Lord, give me clarity that embraces the wholeness of truth.",
            "emotions": [
                "overthinking",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "3-3",
            "chapter": 3,
            "verse": 3,
            "sanskrit": "श्रीभगवानुवाच। लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ। ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम्॥",
            "transliteration": "śhrī bhagavān uvācha loke 'smin dvi-vidhā niṣhṭhā purā proktā mayānagha jñāna-yogena sāṅkhyānāṁ karma-yogena yoginām",
            "simpleMeaning": "The Supreme Lord said: O sinless one, I have previously explained two paths for the world — the path of knowledge for the contemplative and the path of action for the active.",
            "practicalExplanation": "There are two valid paths: knowledge for the contemplative mind, action for the active personality. Both lead to the same goal. Choose according to your nature.",
            "strengthReflection": "I choose the path that suits my nature, knowing all sincere paths lead to truth.",
            "devotionalSurrender": "O Lord, guide me to the path most suited to my nature.",
            "emotions": [
                "duty",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "3-4",
            "chapter": 3,
            "verse": 4,
            "sanskrit": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते। न च संन्यसनादेव सिद्धिं समधिगच्छति॥",
            "transliteration": "na karmaṇām anārambhān naiṣhkarmyaṁ puruṣho 'śhnute na cha sannyasanād eva siddhiṁ samadhigachchhati",
            "simpleMeaning": "Not by merely abstaining from action does one attain freedom from karma, nor does one attain perfection by mere renunciation.",
            "practicalExplanation": "Running away from action doesn't free you from karma. External renunciation without internal transformation is useless. True freedom comes from how you act, not whether you act.",
            "strengthReflection": "I seek freedom through transformed action, not through avoidance.",
            "devotionalSurrender": "Lord, free me from karma through wisdom in action, not escape from action.",
            "emotions": [
                "fear",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "3-5",
            "chapter": 3,
            "verse": 5,
            "sanskrit": "न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत्। कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः॥",
            "transliteration": "na hi kaśhchit kṣhaṇam api jātu tiṣhṭhaty akarma-kṛit kāryate hy avaśhaḥ karma sarvaḥ prakṛiti-jair guṇaiḥ",
            "simpleMeaning": "Indeed, no one can remain without action even for a moment. Everyone is driven to act helplessly by the qualities born of material nature.",
            "practicalExplanation": "Complete inaction is impossible - even sitting still involves action. Nature forces us to act. Since action is inevitable, the question is not whether to act but how to act wisely.",
            "strengthReflection": "Since I must act anyway, I choose to act consciously and wisely.",
            "devotionalSurrender": "Lord, since I cannot escape action, teach me to act in alignment with Your will.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-6",
            "chapter": 3,
            "verse": 6,
            "sanskrit": "कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन्। इन्द्रियार्थान्विमूढात्मा मिथ्याचारः स उच्यते॥",
            "transliteration": "karmendriyāṇi saṁyamya ya āste manasā smaran indriyārthān vimūḍhātmā mithyāchāraḥ sa uchyate",
            "simpleMeaning": "One who restrains the organs of action but mentally dwells on sense objects is deluded and is called a hypocrite.",
            "practicalExplanation": "External restraint with internal craving is hypocrisy. What matters is where your mind dwells, not just what your body does. Inner and outer must align.",
            "strengthReflection": "I align my inner thoughts with my outer actions, avoiding the trap of hypocrisy.",
            "devotionalSurrender": "Lord, purify both my actions and my thoughts. Let me be authentic within and without.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-7",
            "chapter": 3,
            "verse": 7,
            "sanskrit": "यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन। कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते॥",
            "transliteration": "yas tv indriyāṇi manasā niyamyārabhate 'rjuna karmendriyaiḥ karma-yogam asaktaḥ sa viśhiṣhyate",
            "simpleMeaning": "But one who controls the senses with the mind, O Arjuna, and engages the organs of action in karma yoga without attachment — such a person excels.",
            "practicalExplanation": "The superior path: control the mind, then engage in action without attachment. This is karma yoga - working fully while remaining inwardly free. Excellence through detached engagement.",
            "strengthReflection": "I engage fully in action while maintaining inner detachment from results.",
            "devotionalSurrender": "O Arjuna's guide, help me master karma yoga - full engagement with complete detachment.",
            "emotions": [
                "duty",
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "3-8",
            "chapter": 3,
            "verse": 8,
            "sanskrit": "नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः। शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः॥",
            "transliteration": "niyataṁ kuru karma tvaṁ karma jyāyo hy akarmaṇaḥ śharīra-yātrāpi cha te na prasiddhyed akarmaṇaḥ",
            "simpleMeaning": "Perform your prescribed duties, for action is superior to inaction. Even the maintenance of your body would not be possible through inaction.",
            "practicalExplanation": "Do your duty! Action is always better than inaction. Even basic survival requires action. The path is through engagement, not withdrawal.",
            "strengthReflection": "I embrace my duties knowing that active engagement is always superior to avoidance.",
            "devotionalSurrender": "Lord, I will perform my duties. Guide me in right action.",
            "emotions": [
                "duty",
                "discipline",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "3-9",
            "chapter": 3,
            "verse": 9,
            "sanskrit": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः। तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर॥",
            "transliteration": "yajñārthāt karmaṇo 'nyatra loko 'yaṁ karma-bandhanaḥ tad-arthaṁ karma kaunteya mukta-saṅgaḥ samāchara",
            "simpleMeaning": "Work done as a sacrifice for the Supreme frees one from bondage. Therefore, O son of Kunti, perform your duties for His sake, free from attachment.",
            "practicalExplanation": "Action binds only when done selfishly. Action done as offering to the Divine liberates. The same action produces bondage or freedom depending on the spirit behind it.",
            "strengthReflection": "I transform ordinary work into sacred offering by dedicating it to a higher purpose.",
            "devotionalSurrender": "O Kaunteya's Lord, I offer all my actions to You. Accept them as my sacrifice.",
            "emotions": [
                "duty",
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-10",
            "chapter": 3,
            "verse": 10,
            "sanskrit": "सहयज्ञाः प्रजाः सृष्ट्वा पुरोवाच प्रजापतिः। अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक्॥",
            "transliteration": "saha-yajñāḥ prajāḥ sṛiṣhṭvā purovācha prajāpatiḥ anena prasaviṣhyadhvam eṣha vo 'stv iṣhṭa-kāma-dhuk",
            "simpleMeaning": "In the beginning, the Creator created humanity together with sacrifice and said: By this shall you prosper; may this fulfill all your desires.",
            "practicalExplanation": "Humanity was created with the principle of sacrifice. Giving, not just taking, is built into our nature. Prosperity comes through contribution, not accumulation.",
            "strengthReflection": "I prosper by contributing, not just by accumulating.",
            "devotionalSurrender": "Lord, teach me the spirit of sacrifice that brings true prosperity.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-11",
            "chapter": 3,
            "verse": 11,
            "sanskrit": "देवान्भावयतानेन ते देवा भावयन्तु वः। परस्परं भावयन्तः श्रेयः परमवाप्स्यथ॥",
            "transliteration": "devān bhāvayatānena te devā bhāvayantu vaḥ parasparaṁ bhāvayantaḥ śhreyaḥ param avāpsyatha",
            "simpleMeaning": "Nourish the gods with sacrifice, and the gods will nourish you. By nourishing one another, you will attain the supreme good.",
            "practicalExplanation": "The universe operates on reciprocity. Give and receive. When we contribute to the cosmic order, it supports us in return. Mutual nourishment creates prosperity for all.",
            "strengthReflection": "I participate in the cycle of giving and receiving that sustains all life.",
            "devotionalSurrender": "Lord, let me be part of the cosmic exchange of giving and receiving.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-12",
            "chapter": 3,
            "verse": 12,
            "sanskrit": "इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविताः। तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव सः॥",
            "transliteration": "iṣhṭān bhogān hi vo devā dāsyante yajña-bhāvitāḥ tair dattān apradāyaibhyo yo bhuṅkte stena eva saḥ",
            "simpleMeaning": "Nourished by sacrifice, the gods will give you desired enjoyments. One who enjoys their gifts without giving back is verily a thief.",
            "practicalExplanation": "Taking without giving back makes you a thief. This applies to all of life - resources, relationships, communities. Contribution is not optional; it's an ethical obligation.",
            "strengthReflection": "I give back for what I receive. I am not a taker but a contributor.",
            "devotionalSurrender": "Lord, save me from being a thief. Help me give back to life what life gives me.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-13",
            "chapter": 3,
            "verse": 13,
            "sanskrit": "यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः। भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात्॥",
            "transliteration": "yajña-śhiṣhṭāśhinaḥ santo muchyante sarva-kilbiṣhaiḥ bhuñjate te tv aghaṁ pāpā ye pachanty ātma-kāraṇāt",
            "simpleMeaning": "The righteous who eat the remnants of sacrifice are freed from all sins. But those who cook only for themselves eat only sin.",
            "practicalExplanation": "Those who first offer and then enjoy are freed from sin. Those who consume only for self-interest accumulate negativity. Share before you consume.",
            "strengthReflection": "I practice offering before consuming - in food, resources, and all of life.",
            "devotionalSurrender": "Lord, let me always offer first and then enjoy what remains.",
            "emotions": [
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "3-14",
            "chapter": 3,
            "verse": 14,
            "sanskrit": "अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः। यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः॥",
            "transliteration": "annād bhavanti bhūtāni parjanyād anna-sambhavaḥ yajñād bhavati parjanyo yajñaḥ karma-samudbhavaḥ",
            "simpleMeaning": "All beings are sustained by food; food is produced by rain; rain comes from sacrifice; sacrifice is born of action.",
            "practicalExplanation": "Everything is interconnected in a cosmic cycle. Our actions participate in this cycle. When we act rightly, we support the entire web of existence.",
            "strengthReflection": "I recognize my actions as part of a cosmic interconnection affecting all life.",
            "devotionalSurrender": "Lord, let my actions support and nourish the great chain of being.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-15",
            "chapter": 3,
            "verse": 15,
            "sanskrit": "कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम्। तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम्॥",
            "transliteration": "karma brahmodbhavaṁ viddhi brahmākṣhara-samudbhavam tasmāt sarva-gataṁ brahma nityaṁ yajñe pratiṣhṭhitam",
            "simpleMeaning": "Know that prescribed duties arise from the Vedas, and the Vedas come from the Imperishable. Therefore, the all-pervading Brahman is eternally established in sacrifice.",
            "practicalExplanation": "All duty originates from the Divine. The cosmic order is sustained by sacrifice. When we fulfill our duties, we participate in this divine order.",
            "strengthReflection": "My duties connect me to the cosmic order and the Divine.",
            "devotionalSurrender": "O Lord, I see Your presence in all duty. Let my work be my worship.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-16",
            "chapter": 3,
            "verse": 16,
            "sanskrit": "एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः। अघायुरिन्द्रियारामो मोघं पार्थ स जीवति॥",
            "transliteration": "evaṁ pravartitaṁ chakraṁ nānuvartayatīha yaḥ aghāyur indriyārāmo moghaṁ pārtha sa jīvati",
            "simpleMeaning": "One who does not follow this established cycle of sacrifice, living a life of sin and sense pleasure, lives in vain, O Partha.",
            "practicalExplanation": "To refuse participation in the cosmic order while enjoying its benefits is to live in vain. We cannot opt out of giving while continuing to receive.",
            "strengthReflection": "I refuse to live a meaningless life of pure consumption. I participate and contribute.",
            "devotionalSurrender": "Lord, save me from a futile existence. Let me participate meaningfully in Your cosmic dance.",
            "emotions": [
                "duty",
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-17",
            "chapter": 3,
            "verse": 17,
            "sanskrit": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः। आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते॥",
            "transliteration": "yas tv ātma-ratir eva syād ātma-tṛiptaśh cha mānavaḥ ātmany eva cha santuṣhṭas tasya kāryaṁ na vidyate",
            "simpleMeaning": "But for one who delights in the Self alone, who is satisfied with the Self, and who is content in the Self — for such a person, there is no duty.",
            "practicalExplanation": "The fully self-realized person has no obligatory duties because they have transcended all personal needs. But until that point, duty remains binding. Don't pretend enlightenment you haven't achieved.",
            "strengthReflection": "Until I reach full self-realization, I embrace my duties without excuses.",
            "devotionalSurrender": "Lord, until I am fully established in You, guide me in faithful performance of duty.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-18",
            "chapter": 3,
            "verse": 18,
            "sanskrit": "नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन। न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः॥",
            "transliteration": "naiva tasya kṛitenārtho nākṛiteneha kaśhchana na chāsya sarva-bhūteṣhu kaśhchid artha-vyapāśhrayaḥ",
            "simpleMeaning": "Such a self-realized person has nothing to gain from action or inaction, nor does such a person depend on any being for any purpose.",
            "practicalExplanation": "The enlightened person gains nothing from action and loses nothing from inaction. Complete independence from all needs and beings. This is the ultimate freedom.",
            "strengthReflection": "I move toward independence from outcomes while remaining engaged in life.",
            "devotionalSurrender": "O Lord, bring me to that state where I need nothing from anyone except You.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-19",
            "chapter": 3,
            "verse": 19,
            "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर। असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः॥",
            "transliteration": "tasmād asaktaḥ satataṁ kāryaṁ karma samāchara asakto hy ācharan karma param āpnoti puruṣhaḥ",
            "simpleMeaning": "Therefore, always perform your duty without attachment. By working without attachment, a person attains the Supreme.",
            "practicalExplanation": "The formula is clear: constant duty, zero attachment. Do what needs to be done, but don't cling to results. This path leads to the highest realization.",
            "strengthReflection": "I perform necessary duties consistently while releasing attachment to outcomes.",
            "devotionalSurrender": "Lord, I act in Your service, leaving results to You.",
            "emotions": [
                "duty",
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-20",
            "chapter": 3,
            "verse": 20,
            "sanskrit": "कर्मणैव हि संसिद्धिमास्थिता जनकादयः। लोकसङ्ग्रहमेवापि सम्पश्यन्कर्तुमर्हसि॥",
            "transliteration": "karmaṇaiva hi sansiddhim āsthitā janakādayaḥ loka-saṅgraham evāpi sampaśhyan kartum arhasi",
            "simpleMeaning": "King Janaka and others attained perfection through action. You should also act for the welfare of the world.",
            "practicalExplanation": "Great souls like Janaka achieved liberation while actively ruling kingdoms. Work for the world's welfare, not just personal liberation. True spirituality embraces both.",
            "strengthReflection": "I work for the benefit of others, not just for my own spiritual progress.",
            "devotionalSurrender": "Lord, let my actions serve the welfare of the world.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-21",
            "chapter": 3,
            "verse": 21,
            "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
            "transliteration": "yad yad ācharati śhreṣhṭhas tat tad evetaro janaḥ sa yat pramāṇaṁ kurute lokas tad anuvartate",
            "simpleMeaning": "Whatever a great person does, common people follow. Whatever standards such a person sets, the world pursues.",
            "practicalExplanation": "Leaders set examples. Whatever influential people do, others imitate. Therefore, leaders have extra responsibility to act rightly. Your influence shapes others.",
            "strengthReflection": "I recognize my influence on others and act as a positive example.",
            "devotionalSurrender": "Lord, let my actions be worthy of imitation. Make me a positive influence.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-22",
            "chapter": 3,
            "verse": 22,
            "sanskrit": "न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन। नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि॥",
            "transliteration": "na me pārthāsti kartavyaṁ triṣhu lokeṣhu kiñchana nānavāptam avāptavyaṁ varta eva cha karmaṇi",
            "simpleMeaning": "O Partha, there is nothing in the three worlds that I need to do, nothing left for Me to attain. Yet I continue to act.",
            "practicalExplanation": "Krishna, the Supreme, has nothing to accomplish yet continues to act. Action is not just for gaining something - it is a mode of being, of contribution, of expression.",
            "strengthReflection": "I act not just to gain but to express, contribute, and participate in life.",
            "devotionalSurrender": "O Lord who needs nothing yet acts, teach me selfless action.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-23",
            "chapter": 3,
            "verse": 23,
            "sanskrit": "यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः। मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः॥",
            "transliteration": "yadi hy ahaṁ na varteyaṁ jātu karmaṇy atandritaḥ mama vartmānuvartante manuṣhyāḥ pārtha sarvaśhaḥ",
            "simpleMeaning": "If I did not engage in action tirelessly, O Partha, people would follow My path in every way.",
            "practicalExplanation": "If the Divine stopped working, people would think inaction is acceptable. Leaders cannot afford to set bad examples. Responsibility grows with influence.",
            "strengthReflection": "I maintain active engagement, knowing others may follow my example.",
            "devotionalSurrender": "Lord, help me be tireless in right action as You are.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-24",
            "chapter": 3,
            "verse": 24,
            "sanskrit": "उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम्। सङ्करस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः॥",
            "transliteration": "utsīdeyur ime lokā na kuryāṁ karma ched aham saṅkarasya cha kartā syām upahanyām imāḥ prajāḥ",
            "simpleMeaning": "If I ceased to act, these worlds would perish. I would be the cause of confusion and the destruction of all people.",
            "practicalExplanation": "If the Divine stopped maintaining cosmic order, chaos would result. Similarly, when we abandon our duties, we contribute to social disorder. Our actions matter.",
            "strengthReflection": "I recognize that my actions support the order of my world. I act responsibly.",
            "devotionalSurrender": "Lord, help me understand how my actions support the greater order.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-25",
            "chapter": 3,
            "verse": 25,
            "sanskrit": "सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत। कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसङ्ग्रहम्॥",
            "transliteration": "saktāḥ karmaṇy avidvānso yathā kurvanti bhārata kuryād vidvāns tathāsaktas chikīrṣhur loka-saṅgraham",
            "simpleMeaning": "As the ignorant act with attachment, O Bharata, so should the wise act without attachment, for the welfare of the world.",
            "practicalExplanation": "Both wise and ignorant engage in action. The difference is attachment. The wise work equally hard but for the world's benefit, not personal gain.",
            "strengthReflection": "I match the intensity of action of worldly people but direct it toward higher purposes.",
            "devotionalSurrender": "Lord, let me work as hard as anyone but for purposes that serve all.",
            "emotions": [
                "duty",
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-26",
            "chapter": 3,
            "verse": 26,
            "sanskrit": "न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम्। जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन्॥",
            "transliteration": "na buddhi-bhedaṁ janayed ajñānāṁ karma-saṅginām joṣhayet sarva-karmāṇi vidvān yuktaḥ samācharan",
            "simpleMeaning": "The wise should not unsettle the minds of the ignorant who are attached to action. Rather, by performing duties steadily, they should inspire others to act.",
            "practicalExplanation": "Don't confuse beginners with advanced teachings they can't apply. Meet people where they are. Lead by example rather than preaching beyond people's capacity.",
            "strengthReflection": "I help others grow gradually, meeting them where they are, leading by example.",
            "devotionalSurrender": "Lord, give me wisdom to guide others appropriately without causing confusion.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-27",
            "chapter": 3,
            "verse": 27,
            "sanskrit": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः। अहङ्कारविमूढात्मा कर्ताहमिति मन्यते॥",
            "transliteration": "prakṛiteḥ kriyamāṇāni guṇaiḥ karmāṇi sarvaśhaḥ ahaṅkāra-vimūḍhātmā kartāham iti manyate",
            "simpleMeaning": "All actions are performed by the three modes of material nature. But one deluded by ego thinks 'I am the doer.'",
            "practicalExplanation": "Nature does everything through its qualities. The ego falsely claims doership. When we think 'I am acting,' we are confused. Understanding this frees us from the burden of doership.",
            "strengthReflection": "I recognize that actions happen through nature. I release the burden of being 'the doer.'",
            "devotionalSurrender": "Lord, free me from the ego that claims doership. Let me see Your hand in all action.",
            "emotions": [
                "self-doubt",
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-28",
            "chapter": 3,
            "verse": 28,
            "sanskrit": "तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः। गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते॥",
            "transliteration": "tattva-vit tu mahā-bāho guṇa-karma-vibhāgayoḥ guṇā guṇeṣhu vartanta iti matvā na sajjate",
            "simpleMeaning": "But one who knows the truth about the divisions of the modes of nature and their actions, O mighty-armed one, understanding that it is the modes acting upon each other, does not become attached.",
            "practicalExplanation": "The wise see that it's qualities (gunas) interacting with qualities. Senses perceiving objects, that's all. Seeing this truth removes attachment and creates inner freedom.",
            "strengthReflection": "I observe actions as natural interactions of energies, reducing my attachment to outcomes.",
            "devotionalSurrender": "O Mighty-armed, grant me this vision that sees beyond personal involvement.",
            "emotions": [
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-29",
            "chapter": 3,
            "verse": 29,
            "sanskrit": "प्रकृतेर्गुणसम्मूढाः सज्जन्ते गुणकर्मसु। तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत्॥",
            "transliteration": "prakṛiter guṇa-sammūḍhāḥ sajjante guṇa-karmasu tān akṛitsna-vido mandān kṛitsna-vin na vichālayet",
            "simpleMeaning": "Those deluded by the modes of material nature become attached to material actions. The wise should not unsettle these less intelligent people who do not understand the complete truth.",
            "practicalExplanation": "Don't disturb those who can't yet grasp higher truths. Respect where people are in their journey. Advanced teachings given prematurely can cause confusion and harm.",
            "strengthReflection": "I respect each person's stage of development and share wisdom appropriately.",
            "devotionalSurrender": "Lord, grant me patience and wisdom in helping others grow at their own pace.",
            "emotions": [
                "discipline",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "3-30",
            "chapter": 3,
            "verse": 30,
            "sanskrit": "मयि सर्वाणि कर्माणि संन्यस्याध्यात्मचेतसा। निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः॥",
            "transliteration": "mayi sarvāṇi karmāṇi sannyasyādhyātma-chetasā nirāśhīr nirmamo bhūtvā yudhyasva vigata-jvaraḥ",
            "simpleMeaning": "Surrendering all actions to Me, with your mind fixed on the Self, free from desire and selfishness, fight without mental fever.",
            "practicalExplanation": "The complete formula: surrender all actions to God, focus on the Self, release desire and possessiveness, and act without anxiety. This is the essence of karma yoga.",
            "strengthReflection": "I surrender my actions to the Divine, releasing desire and anxiety.",
            "devotionalSurrender": "O Lord, I surrender all my actions to You. Free from anxiety, I engage in my duty.",
            "emotions": [
                "fear",
                "attachment",
                "duty"
            ],
            "audioUrl": null
        },
        {
            "id": "3-31",
            "chapter": 3,
            "verse": 31,
            "sanskrit": "ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः। श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः॥",
            "transliteration": "ye me matam idaṁ nityam anutiṣhṭhanti mānavāḥ śhraddhāvanto 'nasūyanto muchyante te 'pi karmabhiḥ",
            "simpleMeaning": "Those who constantly follow this teaching of Mine with faith and without envy are freed from the bondage of actions.",
            "practicalExplanation": "Faith and freedom from envy are keys. Follow these teachings with genuine trust and openness, and freedom from karma is assured. Consistency matters.",
            "strengthReflection": "I follow this wisdom with faith and without envy, trusting in eventual freedom.",
            "devotionalSurrender": "O Lord, with faith and without jealousy, I follow Your teaching. Free me from karmic bondage.",
            "emotions": [
                "duty",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-32",
            "chapter": 3,
            "verse": 32,
            "sanskrit": "ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम्। सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः॥",
            "transliteration": "ye tv etad abhyasūyanto nānutiṣhṭhanti me matam sarva-jñāna-vimūḍhāns tān viddhi naṣhṭān achetasaḥ",
            "simpleMeaning": "But those who criticize this teaching and do not follow it, know them to be devoid of all knowledge, deluded, and doomed.",
            "practicalExplanation": "Rejecting wisdom while criticizing it leads to destruction. Some people prefer comfortable ignorance to challenging truth. They lose both knowledge and growth.",
            "strengthReflection": "I remain open to wisdom that challenges me, avoiding the trap of dismissive criticism.",
            "devotionalSurrender": "Lord, save me from the closed-mindedness that rejects Your divine wisdom.",
            "emotions": [
                "self-doubt",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-33",
            "chapter": 3,
            "verse": 33,
            "sanskrit": "सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि। प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति॥",
            "transliteration": "sadṛiśhaṁ cheṣhṭate svasyāḥ prakṛiter jñānavān api prakṛitiṁ yānti bhūtāni nigrahaḥ kiṁ kariṣhyati",
            "simpleMeaning": "Even a person of knowledge acts according to their own nature. All beings follow their nature. What can repression accomplish?",
            "practicalExplanation": "Everyone acts according to nature. Forced repression doesn't work long-term. Real change comes through understanding and gradual transformation, not suppression.",
            "strengthReflection": "I work with my nature rather than against it, transforming gradually through understanding.",
            "devotionalSurrender": "Lord, help me transform my nature from within rather than merely suppressing it.",
            "emotions": [
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "3-34",
            "chapter": 3,
            "verse": 34,
            "sanskrit": "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ॥",
            "transliteration": "indriyasyendriyasyārthe rāga-dveṣhau vyavasthitau tayor na vaśham āgachchhet tau hy asya paripanthinau",
            "simpleMeaning": "Attachment and aversion toward sense objects are seated in the senses. One should not come under their sway, for they are obstacles on the path.",
            "practicalExplanation": "Attraction and aversion are natural to the senses, but don't let them control you. They are roadblocks on the spiritual path. Recognize them without obeying them.",
            "strengthReflection": "I observe my attractions and aversions without being controlled by them.",
            "devotionalSurrender": "Lord, free me from the tyranny of likes and dislikes that block my path to You.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-35",
            "chapter": 3,
            "verse": 35,
            "sanskrit": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥",
            "transliteration": "śhreyān sva-dharmo viguṇaḥ para-dharmāt svanuṣhṭhitāt sva-dharme nidhanaṁ śhreyaḥ para-dharmo bhayāvahaḥ",
            "simpleMeaning": "It is better to perform one's own duty imperfectly than to perform another's duty perfectly. Death in one's own duty is preferable; another's duty is fraught with danger.",
            "practicalExplanation": "Stick to your own path, even if imperfect. Imitating others' paths leads to danger. Your unique duty, even if challenging, is your true path to growth.",
            "strengthReflection": "I embrace my unique path and purpose, not envying or imitating others.",
            "devotionalSurrender": "Lord, help me find and follow my sva-dharma, my own true path.",
            "emotions": [
                "self-doubt",
                "duty",
                "fear"
            ],
            "audioUrl": null
        },
        {
            "id": "3-36",
            "chapter": 3,
            "verse": 36,
            "sanskrit": "अर्जुन उवाच। अथ केन प्रयुक्तोऽयं पापं चरति पूरुषः। अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः॥",
            "transliteration": "arjuna uvācha atha kena prayukto 'yaṁ pāpaṁ charati pūruṣhaḥ anichchhann api vārṣhṇeya balād iva niyojitaḥ",
            "simpleMeaning": "Arjuna said: O descendant of Vrishni, what compels a person to commit sin, even against their will, as if driven by force?",
            "practicalExplanation": "Arjuna asks the crucial question: why do we do wrong even when we don't want to? What force compels us against our better judgment? This begins the exploration of inner enemies.",
            "strengthReflection": "I examine the forces that compel me toward actions against my values.",
            "devotionalSurrender": "O Lord, reveal to me what forces compel me to act against my true nature.",
            "emotions": [
                "self-doubt",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-37",
            "chapter": 3,
            "verse": 37,
            "sanskrit": "श्रीभगवानुवाच। काम एष क्रोध एष रजोगुणसमुद्भवः। महाशनो महापाप्मा विद्ध्येनमिह वैरिणम्॥",
            "transliteration": "śhrī bhagavān uvācha kāma eṣha krodha eṣha rajo-guṇa-samudbhavaḥ mahāśhano mahā-pāpmā viddhy enam iha vairiṇam",
            "simpleMeaning": "The Supreme Lord said: It is desire, it is anger, born of the mode of passion. It is all-devouring and the greatest sin. Know this as the enemy here.",
            "practicalExplanation": "Krishna identifies the enemy: desire and its offspring, anger. They come from rajas (passion) and are insatiable and sinful. Knowing your enemy is the first step to victory.",
            "strengthReflection": "I identify desire and anger as my inner enemies and resolve to overcome them.",
            "devotionalSurrender": "Lord, help me conquer the enemies of desire and anger that dwell within me.",
            "emotions": [
                "anger",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "3-38",
            "chapter": 3,
            "verse": 38,
            "sanskrit": "धूमेनाव्रियते वह्निर्यथादर्शो मलेन च। यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम्॥",
            "transliteration": "dhūmenāvriyate vahnir yathādarśho malena cha yatholbenāvṛito garbhas tathā tenedam āvṛitam",
            "simpleMeaning": "As fire is covered by smoke, a mirror by dust, and an embryo by the womb, so knowledge is covered by desire.",
            "practicalExplanation": "Three metaphors show how desire obscures knowledge: smoke covers fire, dust covers a mirror, the womb covers an embryo. The covering can be thin or thick, but it always obscures.",
            "strengthReflection": "I recognize how desire clouds my knowledge and judgment. I work to clear the covering.",
            "devotionalSurrender": "Lord, clear away the smoke of desire that obscures Your light within me.",
            "emotions": [
                "attachment",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-39",
            "chapter": 3,
            "verse": 39,
            "sanskrit": "आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा। कामरूपेण कौन्तेय दुष्पूरेणानलेन च॥",
            "transliteration": "āvṛitaṁ jñānam etena jñānino nitya-vairiṇā kāma-rūpeṇa kaunteya duṣhpūreṇānalena cha",
            "simpleMeaning": "O son of Kunti, knowledge is covered by this eternal enemy of the wise, taking the form of desire, which is as insatiable as fire.",
            "practicalExplanation": "Desire is the eternal enemy of the wise - never satisfied, always burning. Like fire that consumes more fuel and grows larger, desire fed grows rather than diminishes.",
            "strengthReflection": "I recognize that feeding desire only makes it grow. I practice restraint.",
            "devotionalSurrender": "O Kaunteya's Lord, extinguish the fire of insatiable desire within me.",
            "emotions": [
                "attachment",
                "discipline"
            ],
            "audioUrl": null
        },
        {
            "id": "3-40",
            "chapter": 3,
            "verse": 40,
            "sanskrit": "इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते। एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम्॥",
            "transliteration": "indriyāṇi mano buddhir asyādhiṣhṭhānam uchyate etair vimohayaty eṣha jñānam āvṛitya dehinam",
            "simpleMeaning": "The senses, mind, and intellect are said to be its seats. Through these, desire covers knowledge and deludes the embodied soul.",
            "practicalExplanation": "Desire operates through senses, mind, and intellect - our entire apparatus of experience and decision. It covers knowledge at every level. We must guard all three.",
            "strengthReflection": "I guard my senses, mind, and intellect from the invasion of consuming desire.",
            "devotionalSurrender": "Lord, protect my senses, mind, and intellect from the enemy of desire.",
            "emotions": [
                "attachment",
                "discipline",
                "overthinking"
            ],
            "audioUrl": null
        },
        {
            "id": "3-41",
            "chapter": 3,
            "verse": 41,
            "sanskrit": "तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ। पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम्॥",
            "transliteration": "tasmāt tvam indriyāṇy ādau niyamya bharatarṣhabha pāpmānaṁ prajahi hy enaṁ jñāna-vijñāna-nāśhanam",
            "simpleMeaning": "Therefore, O best of the Bharatas, first controlling the senses, slay this sinful destroyer of knowledge and self-realization.",
            "practicalExplanation": "The practical instruction: first control the senses, then destroy desire. Start at the outer gate. If you can't control what enters through the senses, the inner battle is already lost.",
            "strengthReflection": "I begin by controlling my senses, the outer gate through which desire enters.",
            "devotionalSurrender": "O Best of Bharatas' guide, help me control my senses and destroy the enemy of desire.",
            "emotions": [
                "discipline",
                "attachment"
            ],
            "audioUrl": null
        },
        {
            "id": "3-42",
            "chapter": 3,
            "verse": 42,
            "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः॥",
            "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ manasas tu parā buddhir yo buddheḥ paratas tu saḥ",
            "simpleMeaning": "The senses are superior to the body; the mind is superior to the senses; the intellect is superior to the mind; and that which is superior to the intellect is the soul.",
            "practicalExplanation": "A hierarchy: body < senses < mind < intellect < soul. Control the higher to master the lower. The soul, your true self, can master intellect, which masters mind, which masters senses.",
            "strengthReflection": "I identify with my highest self, which has power over intellect, mind, and senses.",
            "devotionalSurrender": "Lord, awaken me to my soul's power over all lower faculties.",
            "emotions": [
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "3-43",
            "chapter": 3,
            "verse": 43,
            "sanskrit": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना। जहि शत्रुं महाबाहो कामरूपं दुरासदम्॥",
            "transliteration": "evaṁ buddheḥ paraṁ buddhvā saṁstabhyātmānam ātmanā jahi śhatruṁ mahā-bāho kāma-rūpaṁ durāsadam",
            "simpleMeaning": "Thus knowing the soul to be superior to the intellect, steady the self by the self. O mighty-armed one, slay the enemy in the form of desire, which is difficult to overcome.",
            "practicalExplanation": "Know the soul's supremacy, stabilize yourself in that identity, and from there conquer desire. It's difficult but possible when fighting from the highest ground of soul-awareness.",
            "strengthReflection": "From the position of my highest self, I conquer the difficult enemy of desire.",
            "devotionalSurrender": "O Mighty-armed Lord, I take refuge in the soul's power. Help me slay the enemy of desire.",
            "emotions": [
                "attachment",
                "discipline",
                "self-doubt"
            ],
            "audioUrl": null
        },
        {
            "id": "6-5",
            "chapter": 6,
            "verse": 5,
            "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
            "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet ātmaiva hyātmano bandhur ātmaiva ripur ātmanaḥ",
            "simpleMeaning": "Elevate yourself by your own efforts; do not degrade yourself. For the self is its own friend and its own enemy.",
            "practicalExplanation": "You are both your greatest ally and your worst enemy. Your thoughts, habits, and choices either lift you or pull you down. No one else can save or destroy you the way you can. Take radical responsibility for your growth. Stop blaming external circumstances. Cultivate the inner friend who encourages, disciplines, and believes in your potential.",
            "strengthReflection": "I am the architect of my own destiny. Today, I choose to be my greatest friend — nurturing discipline, courage, and self-belief.",
            "devotionalSurrender": "Krishna, help me conquer the inner enemy of doubt and laziness. Awaken within me the friend who strives, perseveres, and rises with Your grace.",
            "emotions": [
                "self-doubt",
                "discipline",
                "failure",
                "anger"
            ],
            "audioUrl": null
        }
    ],
    "chapters": [
        {
            "id": 1,
            "name": "Arjuna Vishada Yoga",
            "englishName": "The Yoga of Arjuna's Grief",
            "verseCount": 47
        },
        {
            "id": 2,
            "name": "Sankhya Yoga",
            "englishName": "The Yoga of Knowledge",
            "verseCount": 72
        },
        {
            "id": 3,
            "name": "Karma Yoga",
            "englishName": "The Yoga of Action",
            "verseCount": 43
        },
        {
            "id": 4,
            "name": "Jnana Karma Sanyasa Yoga",
            "englishName": "The Yoga of Knowledge and Action",
            "verseCount": 42
        },
        {
            "id": 5,
            "name": "Karma Sanyasa Yoga",
            "englishName": "The Yoga of Renunciation",
            "verseCount": 29
        },
        {
            "id": 6,
            "name": "Dhyana Yoga",
            "englishName": "The Yoga of Meditation",
            "verseCount": 47
        },
        {
            "id": 7,
            "name": "Jnana Vijnana Yoga",
            "englishName": "The Yoga of Knowledge and Wisdom",
            "verseCount": 30
        },
        {
            "id": 8,
            "name": "Akshara Brahma Yoga",
            "englishName": "The Yoga of Imperishable Brahman",
            "verseCount": 28
        },
        {
            "id": 9,
            "name": "Raja Vidya Raja Guhya Yoga",
            "englishName": "The Yoga of Royal Knowledge",
            "verseCount": 34
        },
        {
            "id": 10,
            "name": "Vibhuti Yoga",
            "englishName": "The Yoga of Divine Glories",
            "verseCount": 42
        },
        {
            "id": 11,
            "name": "Vishwarupa Darshana Yoga",
            "englishName": "The Yoga of Universal Form",
            "verseCount": 55
        },
        {
            "id": 12,
            "name": "Bhakti Yoga",
            "englishName": "The Yoga of Devotion",
            "verseCount": 20
        },
        {
            "id": 13,
            "name": "Kshetra Kshetragna Vibhaga Yoga",
            "englishName": "The Yoga of Field and Knower",
            "verseCount": 35
        },
        {
            "id": 14,
            "name": "Gunatraya Vibhaga Yoga",
            "englishName": "The Yoga of Three Gunas",
            "verseCount": 27
        },
        {
            "id": 15,
            "name": "Purushottama Yoga",
            "englishName": "The Yoga of Supreme Person",
            "verseCount": 20
        },
        {
            "id": 16,
            "name": "Daivasura Sampad Vibhaga Yoga",
            "englishName": "The Yoga of Divine and Demonic Qualities",
            "verseCount": 24
        },
        {
            "id": 17,
            "name": "Shraddhatraya Vibhaga Yoga",
            "englishName": "The Yoga of Three Faiths",
            "verseCount": 28
        },
        {
            "id": 18,
            "name": "Moksha Sanyasa Yoga",
            "englishName": "The Yoga of Liberation",
            "verseCount": 78
        }
    ],
    "emotions": [
        {
            "id": "fear",
            "name": "Fear",
            "icon": "🛡️",
            "description": "When your mind is gripped by fear of the unknown"
        },
        {
            "id": "overthinking",
            "name": "Overthinking",
            "icon": "🌀",
            "description": "When thoughts spiral and peace feels distant"
        },
        {
            "id": "failure",
            "name": "Failure",
            "icon": "🔥",
            "description": "When setbacks shake your confidence"
        },
        {
            "id": "self-doubt",
            "name": "Self-Doubt",
            "icon": "⚔️",
            "description": "When you question your own worth and abilities"
        },
        {
            "id": "attachment",
            "name": "Attachment",
            "icon": "🔗",
            "description": "When letting go feels impossible"
        },
        {
            "id": "anger",
            "name": "Anger",
            "icon": "⚡",
            "description": "When rage clouds your clarity"
        },
        {
            "id": "duty",
            "name": "Duty",
            "icon": "🎯",
            "description": "When seeking clarity on your purpose"
        },
        {
            "id": "discipline",
            "name": "Discipline",
            "icon": "🏹",
            "description": "When building strength of character"
        }
    ]
}